{"meta":{"title":"Hexo","subtitle":"","description":"","author":"John Doe","url":"http://yoursite.com","root":"/"},"pages":[],"posts":[{"title":"中国银行业金融科技战略的误区与风险","slug":"FintechRisk","date":"2019-12-31T08:11:29.000Z","updated":"2019-12-31T08:17:48.490Z","comments":true,"path":"2019/12/31/FintechRisk/","link":"","permalink":"http://yoursite.com/2019/12/31/FintechRisk/","excerpt":"","text":"&emsp;&emsp;中国银行业金融科技对比国内外机构金融科技实践，存在不少的差异。我们在基础技术和创新的层级方面仍然有所欠缺。在技术应用的同时，相关的规则制度、安全意识存在薄弱环节。&emsp;&emsp;数字化已经成为国内银行业发展的共识，金融科技的重要性进一步提升。总的来看，银行关于金融科技战略的描述从初期的信息化、智能化、移动化等比较抽象的概念逐渐细化到科技与业务融合、渠道升级改造和本行传统优势及整体战略相结合等较为具体的方面，表明我国银行已经真正开始拥抱金融科技。未来，我们需要跳出当期经济效益的短期思维，着重考虑技术在远端的社会影响。 1.国内外金融科技战略对比&emsp;&emsp;从各家银行金融科技战略表述来看，工商银行、建设银行、招商银行和平安银行走在前列。2016年4家银行就已提出了较为详细的金融科技发展战略。近3年金融科技战略内容一脉相承，逐步深入，体现了较好的战略连贯性。2018年开始，各家银行积极设立金融科技子公司，目前，已成立的银行系金融科技子公司数量已达到10家，其中3家为大型商业银行，6家为股份制商业银行，1家为城商行。股权结构方面，除兴业数金为外部合资型，其余全部为母行全资持有型。&emsp;&emsp;与国际银行相比，国际银行的金融科技战略定位更加准确，其描述方式对科技属性的把握更加到位。而国际银行参与的金融科技实践更是无处不在。&emsp;&emsp;基于战略上的重视，各家银行对金融科技的投入也在不断加大。从公开数据来看，国有大行中，建设银行科技支出占营收收入比例最高，以“零售银行”著称的招商银行则是金融科技投入最多的股份制银行，2018年科技支出占营业收入比例接近2.8%，也是我国银行业科技支出占营业收入比例最高的银行之一，而另一“零售银行”——平安银行虽然从科技支出绝对金额及占营收比例来看都不算突出，但其背靠平安集团，能够获得平安集团的技术支持，因此综合来看，平安银行科技投入金额也相当可观。此外，作为国内首批互联网银行之一，微众银行由于特殊的商业模式对数字化和科技要求高，其科技支出占营业收入比例远远高于传统的商业银行。&emsp;&emsp;尽管我国银行业近年来持续加大科技投入，但和国际领先的商业银行比较来看，我国银行业科技投入仍远远不足。国外银行科技支出占营业收入比例普遍在10%及以上，并且每年都保持了一定比例的增长。摩根大通、富国银行、花旗银行每年科技投入都在数十亿美元以上。同时，各个条线的金融科技应用目标和场景颇为明确，科技的着力点恰当。 2.国内银行业金融科技战略的误区&emsp;&emsp;各行虽然都在积极推进金融科技战略，但认识和执行方面还存在不少问题。&emsp;&emsp;一是重概念轻落实。从2013年余额宝兴起开始，金融科技中的一些概念此起彼伏。互联网金融、移动金融、开放银行、平台银行、智慧银行以及“赋能”、生态化等比比皆是。但每一种概念的内涵和外延并不清晰。如科技赋能、金融生态等，没有一家机构拿出合理的标准和实施路径。内部经营上存在追逐热点和概念的嫌疑，行动上并未跟进。金融科技应当是技术带来的金融创新，重点应当回归到金融创新上。特别在金融科技发展的初期，多数银行简单将流程和业务线上化与金融科技画上等号。后续还倾向于建设无人网点、5G网点、智慧网点等。目前，银行内部各个业务条线已经在逐步思考金融科技应用场景，相关业务融合度在逐步提升，但科技应用的边界、规则仍然不够清晰，也还未深入思考业务发展模式的改变。伴随而来的问题就是，银行的创新往往就是技术用到了现有业务中，而淘宝、Facebook等机构的创新却是在颠覆现有业务模式或金融运行规则。&emsp;&emsp;二是重应用轻基础。客观上，我国金融科技的应用确实在全球较为领先，但我们采用的基础算法、系统架构均来自国外。即使一些大型银行开发的新系统，架构设计主要还是10年前IBM等机构的技术。我们的金融机构并不掌握底层技术，如人脸识别等主要依赖与云从、旷视等科技公司合作。我们大部分是在做科技管理，而不是在做科技开发。从人才培养、科技开发效率来看，我们的基础能力还很薄弱，远远无法和国际银行来做比较。摩根大通有近50000人从事科技相关工作，其中数千名为数据科学家或在科学领域拥有高级学位，超过31000人从事开发工作。&emsp;&emsp;三是重搭建轻管理。技术研发与应用和银行业传统业务模式差异较大，适应的流程和管理模式有所不同。一方面是过程中的管理。当前各家银行内部管理仍然按照层级管理，开发流程也仍然存在业务与开发割裂的问题。开发效率远远落后于IT公司。另一方面是系统的维护和升级。一些系统开发完成后，人员往往存在流动，功能优化和维护工作严重滞后。目前，包括工商银行、建设银行、平安银行、招商银行在内的国内主要银行已经开始实施“科技敏捷”，开发模式将逐步迈向敏捷模式，简化决策流程，管理模式也在优化。摩根大通实行的“战争室”（War rooms），战争室跨越业务线、地理位置、职能和层级，战争室采取集中决策形式，所有参与决策的人会在一起集中商讨，快速提出新的解决方案。&emsp;&emsp;四是重当前轻长远。按照战略地图理论，金融科技应用属于学习和成长层面的信息资本，是实现财务、客户等上层目标的基础支撑。但我们的金融科技战略推出后往往希望快速获得经济效益。索罗悖论提到，科技进步的影响是全方位的，对生产效率的提升并不会直接体现在经济层面。当前，一些机构希望能够通过出售系统的方式来获得收益，这可能有悖于金融科技的发展内涵。技术应用最根本的影响在社会效用上。金融机构需要在社会效用层面上来考虑客户行为变化趋势和流程优化路径，从而调整业务模式。尤其是银行采取对外股权投资的方式推动金融科技应用时，更应当注重技术带来的长远回报。&emsp;&emsp;五是重销售轻运营。销售是“客户”思维，而“运营”则是“用户”思维。“用户”思维关注用户体验，“客户”思维难以适应通过向客户提供近乎免费的服务获取海量客户生活、消费习惯信息、交易数据，不断培养客群高频率使用该服务端口习惯的互联网经营模式，也会使得产品用户友好度不足。同时，增量运营与存量运营混为一谈。银行在存量包袱的影响下，把获客与活客变成了对立的概念。在场景的实际落地运营中，忽略了场景中获客和活客来源不同，限制了场景的全量服务能力，互联网的效用无法发挥，结果是获客和活客目标均难以实现。 3.金融科技战略中的风险&emsp;&emsp;一是投入成本引发的财务风险。科技的研发投入耗费资金较大，产出周期也较长。若银行经营出现波动，容易加重财务负担。以德意志银行为例，今年已经明确表态要削减金融科技的投入。德意志银行连续多年经营业绩表现不佳。在全球数字化背景下，削减科技投入也是无奈之举。对我国银行业而言，还有一些渠道成本的因素。我国银行拥有大量的网点机构，占用的经营成本较高。金融科技作用不断发挥后，网点的效用已经大幅下降，而维持这些网点运转需要较大的费用支出。当前阶段，虽然银行在主动收缩物理网点，但需要缓步进行。物理渠道可能会成为银行金融科技投入中的额外成本。&emsp;&emsp;二是技术本身带来的风险。第一是技术本身不够成熟而形成的风险。以人脸识别为例，虽然各个机构公布的准确率已经达到97%以上，但近期华为的对抗性实验结果颠覆了该技术的根基。而在当前的金融科技各项技术中，人脸识别还被一致认为是较为成熟的技术。对金融行业而言，一旦类似的技术漏洞被利用，就可能会出现重大风险。第二是技术应用中形成的操作风险。技术应用带来便利的同时，由于没有人为控制，会形成一些操作风险。如信用评分模型更新不及时，导致客户信用卡额度被过度调整。同时，技术应用后可能会让现有的管理作出调整，过往的操作风险控制经验不再适用，新形成的操作风险存在被忽略的可能。&emsp;&emsp;三是技术应用过程中的法律冲突。在技术应用过程中，可能会改变客户关系、流程节点、管理关系，而这种改变可能和法律相冲突。例如在将区块链技术融入供应链金融服务中，就需要解决大量的合规性的问题，包括账本中同步并向参与者公布的记录，其法律效力如何认定，是否可以作为确定基本义务和履行义务的依据，再如在供应链金融实际操作中，银行非常关注应收账款债权“转让通知”的法律效应，都会要求一级供应商或核心企业签回“债权转让同意书”，如果无法签回，会造成银行不愿授信。因此，基于区块链的解决方案需要严格遵守供应链金融现行的法律规则开展研究应用。其他还有如与数字代币和数字资产相关的权利义务关系，在现行法律框架中并未明确界定，需通过详细分析确定法律适用问题。&emsp;&emsp;四是信息安全问题需要引起高度重视。在未来，银行必将汇集大量信息，信息安全将成为重中之重。但银行常见的安全防御手段主要针对传统业务和技术架构进行设计和部署，当业务和架构发生变化后，原有安全防御手段可能无法完全满足新环境下安全保障的需求。在系统安全方面，云计算由于其高可靠性、动态可扩展性、超强计算和存储、虚拟化技术和低成本等特点获得了越来越广泛的应用，相应的防护技术手段也需要进一步升级。在数据安全方面，大数据场景中内容不断衍化，数据边界日益模糊，访问主体和客体关系异常复杂，硬件和软件性能要求更高。伴随着信息安全相关的问题就是个人隐私保护。尤其在共享、合作、赋能等金融科技理念的推动下，个人信息不断被收集，但机构对于个人隐私和权利的保护没有跟上，信息泄露事件频繁发生。未来，信息安全将会从技术问题转变为社会问题。 4.对策与建议&emsp;&emsp;一是银行内部改变技术应用的着力点。一般而言，银行都将金融科技作为业务支持和保障，但这与金融科技的理念存在差异。银行最需要的是通过科技的应用，对原有的业务进行优化，并形成新的发展模式，最终形成的是金融创新，而不是技术应用的创新。这就需要银行的金融科技部门在做好服务的同时，从技术角度思考业务逻辑，技术应用的发起点需要从业务变为技术。只有如此，才会逐步改变银行技术开发的路径，形成与互联网公司竞争的实力，也才能形成真正的金融创新。&emsp;&emsp;二是确定良好的场景策略。互联网企业的技术应用场景多数集中在C端，而银行的优势在B端和G端。当前，大型银行积极与政府合作，如建行通过住房租赁平台，逐步加大G端布局。但对于B端的介入，尚缺乏有效路径。银行介入的方式也可能存在一些问题，多数是通过一些特殊的产品，聚焦于一些微观场景，这并不是互联网或大数据思维模式。在现有的研究中，我们认为交易银行可能会是银行介入B端的现实路径，即搭建交易平台，协助企业销售和采购行为，从而建立起新企业信用体系，挖掘客户需求。同时，银行目前也拥有与交易银行相关的产品体系，如现金管理、供应链融资、托管等，相关的监管限制也较小。&emsp;&emsp;三是强化金融科技应用的体制机制。为了切实推动金融科技战略落地，银行需要从顶层设计、组织变革、人才储备、模式创新等方面构建科技创新生态系统，助推银行科技转型。总结敏捷组织实践经验，建立与敏捷转型相配合的激励机制和提拔机制，让敏捷组织在银行生根发芽。对标领先互联网科技企业，建立专职科技HR机制，前瞻性做好IT人力资源规划；建立富有竞争力的薪酬体系和激励机制，为科技人员创造良好的职业发展通道。&emsp;&emsp;","categories":[],"tags":[],"author":"宋效军 李一阳 陈庆祥"},{"title":"金融科技盛宴（六）：银行的人工智能应用","slug":"FintechBanquet6","date":"2019-12-31T07:16:10.000Z","updated":"2019-12-31T08:07:31.193Z","comments":true,"path":"2019/12/31/FintechBanquet6/","link":"","permalink":"http://yoursite.com/2019/12/31/FintechBanquet6/","excerpt":"","text":"一、人工智能发展简介&emsp;&emsp;人工智能的历史几乎与计算计的历史相当，1956 年夏季，以麦卡锡、明斯基、罗切斯特和香农等为首的一批有远见卓识的科学家在一起聚会，共同研究和探讨用机器模拟智能的一系列有关问题，并首次提出了“人工智能”这一术语。伟大的数学家图灵提出的人工智能训练设想时至今日也未过时。&emsp;&emsp;但受到计算机性能、数据等客观因素的制约，人工智能的发展先后经历了两个“寒冬期”，直到 2006 年开始爆发。当年，Hinton 提出了 Deep Belief Nets （DBN），通过 pretraining 的方法使得训练更深的神经网络变得可能；2009 年 Hinton 和 Deng Li 在语音识别系统中首次使用了深度神经网络（DNN）来训练声学模型，最终系统的词错误率（Word Error Rate/WER）有了极大的降低；2012 年 AlexNet 首次在比赛中使用了深层的卷积网络，取得了 16% 的错误率（之前的方法只能达到 25% 的水平）；2016 年 Google DeepMind 开发的 AlphaGo 以 4 比 1 的成绩战胜了人类世界冠军李世石，人工智能彻底“翻身”了。 二、国外银行对人工智能的应用&emsp;&emsp;据金融稳定委员会（FSB）报告，国际银行业对人工智能的应用主要集中在以下几个方面：面向资本运营，集中在资产配置、投研顾问、量化交易等；面向市场分析，集中于趋势预测、风险监控、压力测试；面向客户营销，集中于身份识别、信用评估和虚拟助手；面向金融监管，集中于识别异常交易和风险主体。&emsp;&emsp;2017 年 4 月，富国银行开始试点一款基于 Facebook Messenger 平台的聊天机器人项目，虚拟助手通过与用户交流，为客户提供账户信息，帮助客户重置密码。美国银行（BOA）的智能虚拟助手 Erica，可以通过语音和文字与客户互动，帮助用户查询信用评分、查看消费习惯，为 4500 多万客户提供还款建议、理财指导等。格兰皇家银行使用“LUVO”虚拟对话机器人为客户获取最适合的房屋贷款，努力成为用户“可信任的金融咨询师”。&emsp;&emsp;一些国际监管机构，例如澳大利亚证券及投资委员会（ASIC）、新加坡货币当局（MAS）及美国证券交易委员会（SEC），都在使用人工智能进行可疑交易识别。 三、国内银行对人工智能的应用&emsp;&emsp;人工智能是目前国内银行应用态度最积极的“黑科技”，从各行发布的科技战略中就可见一斑，比如工行提出的“e-I CBC 3.0 智慧银行”、建行提出的“5G 智慧银行”、平安银行提出的三大阶段打造“AI Bank”等，几乎没有哪家银行的科技规划中人工智能不唱主角的。&emsp;&emsp;从应用上看，国内银行主要的应用集中在如下方面： （一）客户识别&emsp;&emsp;在客户识别方面，目前最火的当属“人脸识别”技术。根据 2019 年 Gen Market Insights 的最新研究，中国将成为人脸识别技术领域最大的消费者和市场供应商, 到了 2023 年，中国将占全球人脸识别市场份额的 44.59%，高于 2017 年的 29.39%。中科院孵化的某 AI 公司已经成长为目前业内的人工智能技术第一供应商，为农行、建行、中行、招行等 400 多家银行提供智能服务，据称在 2018 年，其日均调用达到了 2.16 亿次，可见银行目前对“人脸识别”技术的“青睐”。&emsp;&emsp;“人脸识别”是生物识别技术的中一种，由于人工智能的采用，生物识别技术在准确率和速度方面都有了较大提升，是人工智能技术比较实用的落地场景。目前各银行在手机银行、网点、支付等渠道或场景中广泛采用了“人脸识别”、“语音识别”等技术进行客户身份验证。 （二）营销管理&emsp;&emsp;银行的客户层次很丰富，尤其是个人客户。银行在 2014 年前后，就已经出现通过“神经元网络”技术进行客户分群工作的应用。银行的个人客户群体非常庞大，如果没有合适的进行分群分类，是难以支持客户营销和客户关系管理的，而这项基础工作至少每旬应当进行一次，否则客户分群分类信息的更新会非常滞后，但对于银行，尤其是大银行过亿的客户量而言，这是极其消耗资源的工作，但此类工作正是人工智能技术的强项。&emsp;&emsp;互联网科技公司基于“客户画像”技术进行的“精准营销”对于银行而言是很有启发借鉴意义的，这是从人脉、人工营销向“智能”营销转变的主要路径。银行近年也纷纷采用人工智能技术改造客户营销方式，从“客户画像”开始，在原有分群分类的基础上，进一步将对客户的了解推向个人粒度，业务目标也从“千人千面”飙升的“亿人亿面”。&emsp;&emsp;“智能”营销其实在底层上主要是三方面处理技术的协同：客户画像、产品画像和智能匹配。客户画像、产品画像都是力图在画像对象上增加更多维度的标签，使画像对象更加“立体”，信息更加丰富，而智能匹配则是基于上述结果，结合场景实现二者之间的关系识别，比较典型的应用如智能投顾。这三方面都会用到不同类型的人工智能模型算法，以完成海量数据的分析和关系识别，近年来知识图谱技术在这方面的应用正在日趋增多。&emsp;&emsp;“智能”营销对银行业态的改变也具有很大的影响，多数人都在关心人工智能技术对柜员的替代，其实无论对于柜员还是客户经理，“智能”营销技术的不断成熟和改进对银行从业人员产生的深远影响远大于对一般柜面操作的替代。&emsp;&emsp;不过，目前银行的“智能”营销还没有达到互联网科技公司的应用水平，主要还是通过人工智能技术发现“商机”，并将“商机”推送给前台人员，辅助前台人员进行营销工作，还没有大范围形成与客户的直接交互。&emsp;&emsp;随着人工智能技术应用的拓展，银行也在逐步形成对“获客、活客、留客”的全方位“智能”支持，将客户关系管理、客户营销工作通过人工智能技术有效连接起来。 （三）业务运营&emsp;&emsp;集中运营是银行节约成本、内部挖潜的重要手段。得益于互联网技术的发展，汇丰银行早在 1995 年就成立了第一个大型离岸集中作业中心。&emsp;&emsp;国外大银行的运营转型过程已经有 20 多年的历史，从小运营逐步发展到大运营，甚至泛运营。小运营以“账户”的管理工作为核心，包括清算、结算、核算等；“大运营”则将多界面管理、专业后台运营工作等纳入板块；“泛运营”更是覆盖到了采购、物业管理等中后台功能支持板块。&emsp;&emsp;国内银行 2006-2008 年左右，借助于数据集中的完成，运营集中也开始进行，大型运营中心逐步建立。之后，随着人工智能技术的进步，运营效率进一步提升。&emsp;&emsp;得益于人工智能算法带来的图像识别率上升，OCR（Optical Character Recognition，光学字符识别技术）技术可以将原来前台分散进行的证件审核、银行卡识别、票据审核、票据录入等人工操作转移到后台运营中心进行，不仅效率提升，而且风控措施也得到了增强；人工智能技术也在不断提高清结算、对账工作的效率；语音识别、自然语言理解技术的采用，使本已经实现集中化运营的客服中心进一步降低了人员需求，这也使得大量客服中心人员转岗；机器人自动化（RPA）技术正在更加广泛地影响银行的流程设计和运营管理。 （四）风险控制&emsp;&emsp;智能风控的概念大约在 2014 年前后开始逐渐兴起，互联网金融领域在消费信贷方面对人工智能技术的应用推动了智能风控的快速发展。基于神经网络、决策树、机器学习、随机森林等分析方法，银行在信用评分、信贷审批、发欺诈、反洗钱、贷中管理、催收等领域的工作效率大幅提升。&emsp;&emsp;互联网系的银行在技术方面具有一定优势，起步也较早。蚂蚁金服据称 80% 的业务场景都基于模型进行风控，2014 年 12 月微众银行推出的“微粒贷”、2015 年 6 月网商银行推出的“网商贷”、2016 年 12 月网商银行推出的“好人贷”都是采用智能风控技术进行信贷管理，信贷审批效率获得较大提升。&emsp;&emsp;2017 年农行与百度合作推出“AB 贷”，农行负责金融产品的业务设计，百度则提供信用风险控制技术。在网贷产品方面，各传统银行也纷纷有所动作，工行“融 E 贷”、建行“快贷”、广发“E 秒贷”、兴业“兴闪贷”、中行“中银 E 贷”、招行“闪电贷”等，其后都有智能风控技术的支持，以实现比肩互联网公司的业务效率。招行的“天秤系统”据称对交易风险决策的响应速度在 30 毫秒以内，达到客户无感知的情况下做出风险决策。&emsp;&emsp;智能风控对于银行实现对消费场景嵌入、支持在线实时金融服务、推广普惠金融具有极大作用，也可以说是当前落地的人工智能应用中，最有实际业务价值的部分。截至 2018 年末，仅有 700 余人的网商银行已经累计为 1200 万小微企业提供过贷款，披露的不良率为 1.45%，远低于全国小微贷款不良率 5.9% 的平均水平。 四、值得关注的 RPA&emsp;&emsp;1994 年，保罗·阿伦在总结美国等发达国家自 70 年代银行业务再造实践经验的基础上，将哈默的企业流程重塑理论引入银行业，出版了《银行再造——存活和兴旺的蓝图》一书，提出银行流程重塑理论。原中国银监会主席刘明康于 2005 年 10 月在“上海银行业首届合规年会”上，较早提出了国内流程银行的概念。&emsp;&emsp;作为服务业企业，银行对流程的关注由来已久，流程再造是提升内部工作效率、改善外部客户体验的必经之路，但是由于“部门银行”的思维模式影响深远，流程在跨越部门界限的整合设计方面一直进展缓慢，直到来自互联网的竞争倒逼银行更加主动地去改造流程。&emsp;&emsp;以前银行在内部业务系统的设计过程中，也经常会产生一些打破部门边界的想法，但是由于制度、职责等原因，加之对于流程自动化的“信任”度不高，担心业务差错难以及时纠正等，使原本可以实现的自动化设计时有“搁浅”。如今，随着银行对计算机系统的依赖越来越强和人工智能技术的进步，流程自动化以“软件流程自动化（Robotic Process Automation，RPA，也称“机器人自动化”）”技术的面孔重返舞台。&emsp;&emsp;国外方面，印度工业信贷投资银行简称 ICICI。是印度第二大银行，也是世界最大的私营银行之一，规模仅次于印度国家银行（SBI）。总资产约 960 亿美元，在印度拥有 955 个分支机构，并在 17 个国家设有办事处。ICICI 银行是印度第一家，也是全球少数几家在全球范围内部署 RPA 的公司。早在 2012 年 ICICI 便已经开始筹备 RPA，以帮助银行实现数字化转型。到目前为止，ICICI 通过 RPA 已经实现 1350 个业务的流程自动化，主要用于客户新增、交易处理、交易后服务、对账、贷款处理、以及系统之间的数据移动和提取等，技术团队的规模也达到 60 余人。ICICI 的 RPA 被用来捕获和分析银行系统中的信息，并跨多个应用程序自动运行业务流程。时至今日，ICICI 银行运营和客户服务主管 Anubhuti Sanghai 说：“RPA 在 ICICI 银行被大范围应用。在运营领域 RPA 帮助银行每天自动处理 650 万笔交易，同时为超过 3000 万的客户提供售后服务”。&emsp;&emsp;国内方面，2019 年 5 月 17 日，工行 RPA 技术平台启动，被称为是国内银行业的首次企业级应用；5 月 25 日，建行 RPA 系统上线。建行的项目，从 2018 年招标到实施、上线，用时半年，目前内部反映良好，已有更多部门提出应用需求。两大行几乎同时推出 RPA 应用，可见双方对 RPA 技术的兴趣和科技竞争的激烈程度。&emsp;&emsp;上述国内外 RPA 应用既包含业务流程中单环节的自动化，也涉及跨流程、跨业务系统的自动化处理，很多 RPA 设计并不像人们想象的那样“高大上”，而是很简单的类似表格采集技术这样的应用。&emsp;&emsp;采用企业级业务架构设计方式，能够在更大范围内驾驭流程再造，通过流程的梳理，识别低效业务环节或者业务驱动方式，再将综合了人工智能的 RPA 技术应用到流程再造中，这使得 RPA 具备了从企业级层面、从人机协作角度全面提升企业效率的潜能。&emsp;&emsp;RPA 具体使用的技术可以包含很多类型，甚至不能算作一项专门的技术，前文介绍的人工智能应用皆可融入其中，成为一种有机联动企业整体的设计方式，将人工智能目前偏重“点状”应用的局面提升为“线状”、乃至“面状”的应用。 五、关于对银行人工智能应用的思考&emsp;&emsp;银行对人工智能技术的应用态度是非常积极的，这是由银行应对跨界竞争、打破同质化僵局的双重目标决定的。但是在人工智能应用方面，银行仍然存在以下问题： （一）基础研究薄弱&emsp;&emsp;银行整体而言不具备人工智能研发能力，只具备应用能力，而且应用方面大多也是依靠供应商，尽管这在促进科技进步、完善社会分工、高效推动新技术应用方面均无可厚非，但是，这也意味着银行不具备真正驾驭该项技术的能力。&emsp;&emsp;目前，互联网科技头部企业都在人工智能基础研究方面投入较大资源，无论是国外的谷歌、亚马逊、苹果、脸书，还是国内的阿里、腾讯、百度、字节跳动，都在人工智能基础研究方面不惜以重金争夺人才、建立优势。&emsp;&emsp;尽管国内监管上目前“科技公司变银行”这个“车道”已经逐步建立起严格的监管机制，但是从长期趋势来看，“银行变科技公司”这个“车道”可能是无法限制的，也许只是时间问题而已。那么，对于科技公司而言，缺乏对核心技术的掌控力则是难以想象的。 （二）人工智能技术自身带来的问题&emsp;&emsp;人工智能技术在经历过这一轮的空前繁荣后，自身也面临着一些问题：&emsp;&emsp;1. 学习能力方面。人工智能技术尽管目前取得了不小的进步，在之前一致认为不可能战胜人类的围棋领域取得绝对性胜利，在复杂的即时战略等类型游戏上表现抢眼，在语音识别方面逐渐超越人类打字员，但是，其学习方式依然属于“慢”学习类型。2019 年 8 月在吉隆坡“王者荣耀”游戏最高规格的电竞赛事中，“5V5”模式下战胜人类职业玩家的腾讯人工智能系统“绝悟”，其 1 天的训练量可以达到人类 440 年的训练量。这显然不是大家对人工智能期待的学习方式，而且迁移学习方面进展有限，以极大数据量训练的模型很难更换场景使用，这也限制了其发展。人工智能的发展还应当朝向更接近人类思维方式的小数据、可迁移方向演进。&emsp;&emsp;2. 数据隐私方面。随着全世界范围不断增强的数据保护力度，对于金融类业务这种需要大量依靠客户信息、业务信息进行模型训练的领域，如何解决数据确权、数据使用成本问题，虽然不会影响当前的人工智能发展，但是对未来的发展可能会造成一定影响。&emsp;&emsp;3. 人力替代引发的争议。人工智能颇有争议之处就是其不可避免地会带来人力替代，即便很多人认为人工智能应用的主要方向是不断加强人机协同，但随着业务处理效率的上升，仍旧会产生人力替代。未来十年中，这种替代可能在银行业产生比较明显的影响，富国银行预期将会对金融业产生 20 万工作岗位的削减，摩根大通预期会在欧洲产生 6 万工作岗位的削减。工作岗位削减也会伴随各种争议。这将不仅是对存量人力资源的影响，对于新进者的职业技能要求也会逐渐产生变化，新进者需要具备更好的人机协同能力。 参考资料：1.《日均 2.16 亿次人脸比对，“银行最强视觉技术供应商”还不满足？》，2019-07-08，Deeptech 深科技。2.《智慧运营: 银行业竞争的下一个决胜之地》，波士顿咨询，《新金融》2017 年第 12 期。3.《“暖科技”让普惠金融发展跨越“鸿沟”》，2019-08-02，梁昊、王嘉伦，清华金融评论。4.《印度第二大银行 ICICI 通过 RPA，每天自动完成 650 万笔交易》，2019-07-20，RPA 中国。","categories":[],"tags":[],"author":"钰湚"},{"title":"金融科技盛宴（五）：银行的物联网应用","slug":"FintechBanquet5","date":"2019-12-31T07:16:05.000Z","updated":"2019-12-31T07:59:53.652Z","comments":true,"path":"2019/12/31/FintechBanquet5/","link":"","permalink":"http://yoursite.com/2019/12/31/FintechBanquet5/","excerpt":"","text":"一、物联网技术发展简介&emsp;&emsp;物联网概念是 1999 年 MIT Auto-ID 中心的 Ashton 教授在研究 RFID 时最早提出来的，是一个结合了物品编码、RFID 和互联网技术的解决方案。当时基于互联网、RFID 技术、EPC 标准，在计算机互联网的基础上，利用射频识别技术、无线数据通信技术等，构造了一个实现全球物品信息实时共享的实物互联网“Internet of things”（简称物联网）。&emsp;&emsp;2005 年 11 月 17 日，在突尼斯举行的信息社会世界峰会（WSIS）上，国际电信联盟（ITU）发布《ITU 互联网报告 2005：物联网》，引用了“物联网”的概念。物联网的定义和范围已经发生了变化，覆盖范围有了较大的拓展，不再只是指基于 RFID 技术的物联网。&emsp;&emsp;2009 年 1 月 28 日，奥巴马就任美国总统后，与美国工商业领袖举行了一次“圆桌会议”，作为仅有的两名代表之一，IBM 首席执行官彭明盛首次提出“智慧地球”这一概念，建议新政府投资新一代的智慧型基础设施。当年，美国将新能源和物联网列为振兴经济的两大重点。&emsp;&emsp;2009 年 8 月，时任国务院总理温家宝在无锡考察传感网产业发展时明确指示要早一点谋划未来，早一点攻破核心技术，并且明确要求尽快建立中国的传感信息中心。&emsp;&emsp;2016 年 10 月 31 日，世界物联网无锡峰会上，李克强总理指出，“物联网将以其颠覆性变革、全面性渗透，给人类生产生活带来更加广泛而深刻的影响”，倡议建立“营造一个物联网发展的良好生态系统”。&emsp;&emsp;经过十几年的发展，物联网已经逐渐成为多种学科和技术的融合。2018 年 11 月初，在西班牙巴塞罗那举行的 Gartner 研讨会上，该公司提出了 2018 年至 2023 年间十大最具影响力的物联网发展趋势：人工智能；社会、法律和道德；经济学和数据经纪；智能网格；物联网治理；传感器创新；可靠的硬件和操作系统；新物联网用户体验；芯片创新；新无线网络技术。&emsp;&emsp;如今，物联网设备数量正在迅猛增长。据 Gartner 早期预测，物联网设备将在 2019 年达到 142 亿个，到 2021 年将增长到 250 亿个；而根据 IDC 的一项新预测估计，到 2025 年，将有 416 亿台物联网设备，并将产生 79.4 ZB 的数据。 二、国外银行的物联网应用&emsp;&emsp;2015 年 10 月，万事达卡推出了一个名为“Commerce for Every Device”计划，也就是致力于让所有的消费电子产品变成一台有支付功能的设备。2016 年，在 CES 展会上，万事达卡宣布携手位于旧金山的 Coin 公司将支付功能引入可穿戴设备。同年，万事达卡还宣布与 Fit Pay, Inc 合作，将万事达卡数位支援服务 (MDES) 与 Fit Pay 平台整合，还将结盟 Wearatec 等市面上的创新设备制造商，使得万事达卡感应式支付的服务可更完善的建置于穿戴型或其他物联网设备上。&emsp;&emsp;2017 年，美国银行与 Fitpay 合作推出可穿戴支付设备，推出数字钱包计划，改计划使物联网和可穿戴设备制造商能够为其产品增加非接触式支付功能，帮助消费者快速支付，或者是通过美国银行的 ATM 办理业务。&emsp;&emsp;Capital One 于 2015 年公布了与 AWS 合作，探索 AWS Alexa 的金融应用。2016 年，Capital One 提出了业务设计原型，2017 年，双方完成了 Capital One 基于 Alexa 的智能语音银行助手，第一阶段实现了如下功能：信用卡账单支付、信用卡余额查询、储蓄账户余额查询、列出近期消费记录、查询信用卡可用额度、查询信用卡账单到期日、账户信息概况 / 总览等，之后扩展到包括信用卡还款和支票账户使用等功能。&emsp;&emsp;2015 年 6 月，巴克莱银行推出了“可穿戴”支付三件套：手机背面的 NFC 贴纸（也可以把它贴在任何地方）、钥匙挂坠、可穿戴手环，这三者都支持非接触式支付方式（Contactless Payment）。巴克莱银行同时还推出了支持多张银行卡的移动端 APP bPay 钱包，通过 bPay ，用户可以在手机 APP 上进行转账、查看消费记录、管理多个支付设备和多张银行卡，bPay 的移动支付配件不仅仅可以用于巴克莱银行，只要是英国发行的 Visa 和万事达借记卡、信用卡都可以使用。&emsp;&emsp;位于罗马尼亚的 Idea Bank 运营着一个车队，每辆汽车都配有一个安全保险箱和一个 ATM 机，可以随时上门为客户提供服务，而不需要客户到银行办理业务。该银行数据显示，一台移动式汽车自动取款机的平均存款比分行高出三倍。加拿大的 Blueshore 信贷联盟探索在汽车挡风玻璃上显示财富管理应用程序的可能性，以便乘客在开车过程中可了解其投资组合。富国银行也尝试开发基于汽车里的设备提供与银行客户经理视频会议的想法，福特公司也将亚马逊的 Alexa 融入到汽车系统中，汽车也许会成为银行运营物联网技术提供服务的重要载体。 三、国内银行的物联网应用&emsp;&emsp;国内也有很多银行尝试了物联网应用，篇幅所限，仅举几例以供读者参考。 （一）建行&emsp;&emsp;2017 年 7 月，建行上海市分行与华米科技、上海交通卡公司共同推出首款集金融支付、交通出行与健康运动于一体的智能可穿戴设备——“龙支付米动手环”。手环将蓝牙通讯技术应用于金融支付，适用于目前几乎所有智能手机，而不再受制于手机型号和 NFC 功能，更具有普适性。只需与建行客户端配对后添加建行云闪付龙卡，手环便可和带有银联云闪付标识的硬件设备进行互动，用户可以便捷地在 POS 机上“刷手环”消费，并能在 ATM 机上“刷手环”取款。同时，手环还是一张公交卡，用户佩戴手环后就能在上海地铁、公交、轮渡等所有公共交通工具上抬腕支付。&emsp;&emsp;2019 年初，建行深圳分行联手深圳交警，打造智慧交通出行计划，在深圳交警“星级用户”服务平台上线“无感支付”功能，将银行卡与建行无感支付绑定，车牌就相当于银行卡。通过该项目，建行用户出入深圳 1500 多个与建行签约的智慧停车场时，无需停车，系统会识别车牌自动扣费；在深圳中石化科技园南、普滨服务区等加油站加油时，加满即走，全过程自动扣款；在深圳小猫洗车、五分钟洗车等洗车场里，可自动识别车牌自动扣款。 （二）工行&emsp;&emsp;2017 年 6 月，工行自主研发的“工银物联网金融服务平台”成功上线。工行使用物联网技术，在四川分行某企业原酒融资业务风险管理中，通过部署抵押物 RFID 封签报警，押物变化报警，抵押物周边区域出入监控报警，实现报警信息自动收集和风险监测预警，同时，为信贷管理员提供通过 PC、手机实现对融资押品的远程、实时、直接监控；在四川分行某小生产企业的融资业务，采集企业开工情况、车间人员密度、企业水电表信息，准确掌握中小微企业授信“三表”和“三流”信息，为信贷准入、尽职调查、贷后监测预警提供客观及时手段。物联网金融破解小微企业信用评估的难题，进一步助推普惠金融发展，服务实体经济；在江苏分行金库智能化建设中，通过在金库综合运用 RFID 等电子标签、容器货架等智能设备，使用身份认证、定位物联网技术，引入新型货架，支持实物查找、盘点、交接、流转全过程智能管理，提高库房存储能力和工作效率。 （三）兴业银行&emsp;&emsp;兴业银行在 2017 年初，试水 “ 物联网金融 “，推出全国首个家庭银行，借助智能电视为用户提供各类在线银行专属服务，结合大屏交互技术和 O2O 场景创新零售银行渠道和服务模式。&emsp;&emsp;2018 年 1 月 18 日，兴业银行与科大讯飞、京东金融（后改名京东数科）在京举行战略合作签约仪式，宣布三方联手成立 “AI 家庭智慧银行联合实验室 “，建立 “ 金融智能语音硬件产业联盟 “，并推出合作的阶段性成果——“兴业银行智能金融叮咚音箱”，可为零售客户提供账务查询、信用卡在线分期、客服等服务。&emsp;&emsp;2018 年 9 月，兴业银行与科技公司合作，将物联网高科技手段应用于供应链金融业务，实现平行进口汽车控货融资业务的物联网监管。传统控货融资监管需要手工登记台账、人工现场巡库，效率低下、易出错漏、人力成本高、信用风险大、预警不及时等，业内甚至出现过多次重复质押等风险事件。采用物联网监管技术后，可将监管设备与指定车辆绑定，并在指定区域设置电子围栏，即可通过电脑或手机 APP 实时监测绑定车辆的位置信息及移动轨迹，配合 7*24 小时报警功能及数据整理功能，用科技手段提升控货融资业务的效能。 （四）招行&emsp;&emsp;2018 年 7 月，招行与 360 联合推出了一款专门给儿童设计的智能储蓄罐“小招喵智能储蓄罐”。孩子可以通过储蓄罐上的小屏幕看到家长发送的零花钱，该小屏幕还可以当做智能手表佩戴。通过与孩子约定奖励计划，从小培养财商，家长们可以增强与孩子的亲自互动与感情。“小招喵”智能存钱罐是招行首次试水智能硬件，并用 IP 化运作，可连接招行 APP、招行储蓄卡等银行常用的介质。 四、关于对银行物联网应用的思考&emsp;&emsp;从架构角度来讲，物联网设备处于整体架构的最边缘位置；当应用于外部服务时，则是与客户接触的“最后一公里”。随着硬件、云计算、5G 等技术的进步，物联网从最初设备层面的简单连接，逐渐走向具备一定数据处理能力的“边缘计算”方向。&emsp;&emsp;目前各大行已经将物联网技术融入到智慧银行的建设中，用于完善物与物、人与物的连接和协作。四大行纷纷推出了“无人银行”，“无人银行”是一个很好的科技试验和示范区，而“无人银行”主要是以智能设备为主，其连接基础也就包括物联网技术。&emsp;&emsp;总体而言，可联网设备的数量在迅速增长，但是银行对物联网技术的应用仍在探索期。物联网技术能够为银行提供广阔的延伸能力，如今在“智慧城市”、“智慧生活”等与数字中国相关的建设工作中，物联网在提升基础设施服务能力方面扮演者重要角色。&emsp;&emsp;互联网巨头们对市场的瓜分早已经从线上打到线下，物联网技术能够帮助企业更迅速地感知客户、感知需求、积累信息，结合物联网技术的智能设备是新的必争“接触点”。物联网技术尽管有了不少案例，但是在金融行业的整体架构中依然作用有限，对于物联网技术，银行需要结合“边缘计算”进行更具前瞻性的规划，研究如何通过智能设备无限接近、了解客户。 参考资料：1.《Gartner 发布物联网技术十大战略和趋势》，2018-12-09，腾股创投翻译，人人都是产品经理。2.《2018-2025 年物联网设备产生的数据量将以 28.7% 的复合年增长率增长》，2019-06-24，电子发烧友。3.《万事达卡与 Coin 合作 将支付功能引入可穿戴设备》，2016-01-08，天极网。4.《万事达卡宣布与 Fit Pay 共同开发可穿戴支付设备》，2016-11-23，老猫，可穿戴设备网。5.《零售银行中物联网的新案例》，2018-03-24，电子发烧友。6.《物联网改变零售银行业务的 8 个应用案例》，2018-03-07，物联之家。7.《上海建行正式发售龙支付米动手环 试水金融物联网》，2017-07-27，许兵，中国新闻网。8.《物联网金融创新 助力工行智慧转型发展》，2018-02-11，胡稚弘，中国金融电脑。9.《兴业银行与科大讯飞、京东金融宣布成立 “AI 家庭智慧银行联合实验室 “》，2018-01-18，零壹财经。10.《科技创新，服务市场，兴业银行打造“物联网”平行进口汽车供应链金融竞争力》，2018-12-06，搜狐网。","categories":[],"tags":[],"author":"钰湚"},{"title":"金融科技盛宴（四）：银行的移动端应用","slug":"FintechBanquet4","date":"2019-12-31T07:15:58.000Z","updated":"2019-12-31T07:53:33.643Z","comments":true,"path":"2019/12/31/FintechBanquet4/","link":"","permalink":"http://yoursite.com/2019/12/31/FintechBanquet4/","excerpt":"","text":"一、移动端技术发展简介&emsp;&emsp;本文讨论的银行移动端应用主要指手机银行，手机银行是银行对渠道端技术发展的一种适应，每次移动应用开发技术的升级也自然带来手机银行技术的升级。 &emsp;&emsp;手机银行曾经采用过的移动客户端开发技术包括 STK、BREW、WAP、JAVA 等。 &emsp;&emsp;基于 STK 卡的短消息方式是将银行服务的菜单写入特制的 STK 卡，从而便于客户的菜单式操作，同时，STK 卡本身有比较完善的身份认证机制，能有效保障交易安全。2000 年 5 月工行、中行推出 SIM 卡技术的手机银行，可为用户提供账户查询、缴费、转账与证券交易信息等服务，但用户需要把手机的 SIM 卡转换成为专门的 STK 卡，出于换卡成本较高以及对系统安全方面的担忧，STK 卡模式并未得到市场的广泛认同。 &emsp;&emsp;BREW（无线二进制运行环境）是一种基于 CDMA 网络的技术。客户可以通过下载应用软件到手机上运行，从而实现各种功能。BREW 位于芯片软件系统层和应用软件层之间，提供了通用的中间件，直接集成在芯片上，不必通过中间代码就可以直接执行，运营商也可以通过无线方式为客户下载、升级软件。BREW 支持各种加密算法。BREW 在安全性和终端表现的一致性上要优于 Java 方式，但因是高通公司的专利技术，开放性不如 Java。2004 年 7 月，联龙博通和建行、中国联通合作，在建行 38 个一级分行同时推出了基于 BREW 技术的手机银行业务。 &emsp;&emsp;WAP 为无线应用协议的简称，是开发移动网络上类似互联网应用的一系列规范的组合。它使新一代无线通信设备能够可靠地接入 Internet。由于无线网络系统和固定网络系统不一样，加上移动终端的屏幕和键盘都很小，所以 WAP 不适于采用 HTML（超文本标识语言），而需采用专门的 WML（无线标记语言）。WAP2.0 采用 TLS 作为端到端加密的算法。2005 年，联龙博通联合中国联通及建行推出了基于 2.75G CDMA1X 网络的 WAP 手机银行，创造了手机银行全国同时开通的记录，做到了全国全网覆盖。到 WAP2.0 时代，手机银行终于实现了可与网银媲美的功能。 &emsp;&emsp;到了智能手机时代，手机银行客户端应用程序的开发一般要采用专门平台，比如 Andriod 手机的 J2ME 平台，平台配置和框架使得应用程序安装的灵活性得到很大提高。 &emsp;&emsp;跟互联网企业一样，目前各大银行也都已经建立起全面支撑其移动应用开发、构建、发布、测试、运行的一体化移动研发平台，提供 Native、H5 和小程序等多种开发框架，以求实现前端场景化、服务标准化、工具一体化、运维高效化等开发目标。当然，实际开发中也备受手机机型繁多、安全挑战巨大等多种问题的困扰。 二、国外银行的移动端应用（一）美国手机银行的应用情况 &emsp;&emsp;据 Nielsen 公司在 2009 年统计，美国手机银行用户当时已达到 1300 万，虽然其中约三分之二使用的是 SMS（短消息）模式的手机银行。据 comScore 公司的调查，至 2011 年 6 月份，美国约有 13.9% 的移动通讯用户，即 3200 万人曾经使用过手机银行。截至 2013 年 9 月，据 ComScore 再次调查, 美国大约有 1 亿 4790 万智能手机用户，其中约有一半用户使用过手机银行业务，覆盖度相当于超过了美国人口的 20%。此外，在美国的 25 家大型银行中有 21 家提供手机银行存款业务，67% 的手机银行客户通过照片验证的方式进行支票存款，46% 的手机银行客户通过手机摄像头添加新的收款人。 &emsp;&emsp;但是，手机银行对大部分美国人支付习惯的改变仍是缓慢的。虽然在 2013 年美国手机银行的覆盖度已经很高，但据 InfoScout 公司在 2015 年的调研显示，当时 79% 的 iPhone 用户和 74% 的 Android 用户还是选择用信用卡或银行卡支付。 &emsp;&emsp;不过，随着“千禧一代”（1982-2000 年间出生）的成长，这种局面也会逐渐改观。“千禧一代”现在已经很少在走进银行了，他们开始转向了通过电子银行办理银行业务。据统计，2015 年，美国 30-44 岁之间的智能手机用户中有 58％的用户称他们使用手机银行。 &emsp;&emsp;移动支付诞生在美国，但在美国的发展确实不如在中国快。据美国著名调研机构 Forrester Research 的一项估计，美国 2016 年移动支付规模为 1120 亿美元，而据中国公司艾瑞咨询统计，2016 年中国移动支付规模达 9 万亿美元，规模大约为美国同期的 80 倍。据分析机构预计，到 2019 年，美国的移动支付总额将是 2015 年的 2.6 倍；而预计中国的移动支付份额同期将增长 7.4 倍，也即，差距仍将进一步扩大。 &emsp;&emsp;美国手机银行的发展，尤其是在支付领域的发展看起来“差强人意”，但这并非完全是技术原因，多数分析人士认为关键在于美国的信用卡业务比较发达、服务比较好导致银行的服务供给和用户的行为迁移都比较缓慢。 （二）BBVA 的手机银行 &emsp;&emsp;除了美国外，欧洲银行对手机银行重视程度也较高。据 comScore 调查，2011 年 3 月欧洲 5 个主要国家（英、法、德、西班牙、意大利）就已有 2000 万人使用手机银行，比半年前增加 15%，手机银行用户占移动用户总数的 8.5%。 &emsp;&emsp;据 Forrester Research 在 2017 发布的全球手机银行调报告称，通过针对包括美国、英国、法国、巴西、土耳其、中国、澳大利亚等全球超过 18 个国家的 53 家金融银行机构的 APP 调研，西班牙 BBVA 手机银行的服务在此次的调研中获得了 87 分的最高分。 &emsp;&emsp;根据 Forrester Research 的分析，BBVA 的手机银行服务中最令人满意的功能包括多样化的菜单、全球体量下实现交易数字化、个性化功能配置（如帮助客户查询实时房价或租赁价格、养老金计划工具、根据资料引导客户搜索等）。 &emsp;&emsp;截止 2017 年，BBVA 银行在全球拥有超过 1400 万手机端用户，比 2016 年同期增长 41%，而这一数据仅基于银行系统中显示的密集使用银行服务系统的客户。同时，就总体数字渠道用户量而言，BBVA 银行已经拥有 1970 万用户，同比增长 21%，“数字渠道占有率”在西班牙本土首次突破 50%。 &emsp;&emsp;BBVA 手机银行的演变是一个长期积累的过程，最初是从电子银行领域开始的。 &emsp;&emsp;2008 年，BBVA 推出了第一个数字项目“Tú Cuentas（意为“你的账单”）”，是一款用于支出管理的线上产品，线上银行客户可以通过该平台统一管理多种支付手段的个人消费记录。4 个月后“Tú Cuentas”获得了初步的成功，近 1/3 的线上银行客户成为其用户。 &emsp;&emsp;2009 年，与 IDEO 合作、历时 3 年的 ABIL 项目正式部署，这是一款全触摸屏的 ATM 机，其上包括一个名为 Hero 的虚拟助理。2010 年，受到 Hero 的启发，BBVA 开始研发新的交互方式，一个名为 Lola 的全新虚拟助手最终在 2012 年出现在线上银行，Lola 能够以对话的形式辅助客户完成超过 65% 的线上银行服务操作，这比后来的 Conversational UI 的兴起提前了 7 年。 &emsp;&emsp;2011 年 11 月，BBVA 的个人金融服务平台“Contigo Adviser”上线，这个平台使得客户随时随地通过手机与金融顾问互动，这个平台背后是大量系统的集成，也意味着 BBVA 在 2012 年以前就已完成了多个核心系统的整合，这才能够支持通过手机银行实现与客户交互方式的改变。 &emsp;&emsp;2013 年，BBVA 继续加码移动支付领域，推出旗下数字钱包 Wallet，Wallet 使得用户可以在手机应用中管理各种银行卡，并实现线上支付、手机线下近场支付。2013 年 BBVA 对于技术的投入高达 24 亿欧元，是 2006 年的两倍。 &emsp;&emsp;2014 年 2 月，BBVA 通过 117 亿美元收购美国移动银行 Simple。2015 年，以 4500 万英镑购置英国移动银行 Atom Bank 29.5% 股权，通过资本运作继续扩大其手机银行服务能力。 &emsp;&emsp;2016 年 10 月，BBVA 宣布与 Amazon Web Services 合作，以获得处理每天 5 亿 4200 万笔交易的云计算能力；11 月，BBVA 与 CRM 领域巨头 Salesforce 合作，在西班牙实现全手机开户。 &emsp;&emsp;2017 年 3 月，BBVA 继续向英国移动银行 Atom 追加投资，结合自有数据和开放能力，成为在 2018 年前具备交付开放银行能力的欧洲少数金融机构之一。据该行称，2019 年要力争将 50% 的客户转化为数字银行用户。 &emsp;&emsp;BBVA 手机银行的发展显示出了更多的探索意味和对客户的理解，而非简单的渠道迁移。 （三）国内银行的移动端应用 &emsp;&emsp;2019 年 7 月 17 日，中国银行业协会发布的《2018 年中国银行业社会责任报告》称，据不完全统计，截至 2018 年末，手机银行交易笔数达 940.37 亿笔，交易金额达 241.68 万亿。 &emsp;&emsp;中国金融认证中心 CFCA《2018 年电子银行用户使用行为及态度研究》的调查结果显示，2018 年手机银行的用户比例首次超过网上银行，成为用户首选。 &emsp;&emsp;掌中的“方寸之地”已然成为各银行的必争之地，招商银行更是在 2018 年底宣布完成全国网点“全面无卡化改造”项目，成为国内首家实现网点全面无卡化的银行。 &emsp;&emsp;下面简要介绍几家银行的手机银行应用发展情况。 1. 建行 &emsp;&emsp;建行 2004 年即推出覆盖全行范围的手机银行业务，是国内首家。2009 年 11 月底，建行手机银行 (WAP) 客户数达到 1327 万，基于短信模式的手机银行客户达到 6125 万户，两者相加共计 7452 万户，居行业第一。 &emsp;&emsp;智能手机发展成熟之后，随着技术的迭代，2011 年 7 月，建行手机银行 2.0 版推出。 &emsp;&emsp;2012 年 6 月底，建行手机银行客户数为 6510 万户，当年交易量、交易额分别为 0.55 万亿元、1.35 亿笔。2012 年，利用智能手机重力感应功能，建行手机银行在同业中率先实现了“摇一摇”查询、转账等系列功能。 &emsp;&emsp;2014 年 5 月，手机银行 3.0 版推出。2015 年推出手机“快贷”产品，在同业首创从申请到支用的全流程线上贷款服务。2015 年 6 月推出建行企业手机银行，即适合内部处理流程简单、拥有移动办公需求的中小企业财务主管使用，也可满足大型企业高管随时掌控企业财务状况的需要。 &emsp;&emsp;2016 年，推出消息服务订制服务，用户可以通过手机银行随时随地接收账户变动通知、金融行情等消息提醒；推出指纹安全验证，免去输入登陆密码的繁琐操作，利用指纹安全、快速登陆；智能服务进一步拓展渠道覆盖面，智能小微累计服务客户突破 3 亿人次，服务量是全行人工客服量两倍。 &emsp;&emsp;2017 年 3 月，手机银行 4.0 版推出。该版突出以“智慧”为核心，为客户提供智慧财富管理、智慧投融资、智慧生活圈、智慧用户体验服务等“慧”系列产品。提供全面的、图文并茂的资产负债信息；提供消费预算管理，包括投资报告、消费报告、结算报告等用户行为分析；提供二十大类投资理财产品；提供“水电煤”等多种便民缴费项目，以及“衣食住行医教娱”等各类生活服务；提供个性化定制常用功能服务，以简化操作流程。 &emsp;&emsp;截至 2017 年 6 月底，建行手机银行客户数已达 2.44 亿户，当年交易量、交易额分别达到 25.6 万亿元、217.4 亿笔。手机银行已成为建行各业务销售和客户服务的第一大渠道。从重点业务上看，超过 50% 的基金交易、60% 左右的贵金属交易、75% 左右的账户商品交易、超过 80% 的“快贷”申请都是通过手机银行完成的。 &emsp;&emsp;2018 年，建行手机银行在技术上引入语音识别，推出语音菜单导航、智能语音交互等技术；引入图像识别技术，增加刷脸绑定、社交网络分享等功能。推出以智能投顾服务，根据客户历史交易偏好进行投资推荐。 &emsp;&emsp;年报数据显示，2018 年末，建行个人手机银行用户 3.10 亿户，较上年增长 16.20%，超过该行个人网银用户数 3.05 亿户（较上年新增 3,427 万户，增速 12.66%，增速慢于手机银行）；企业手机银行用户数 106 万户，较上年增长 77.67%。 &emsp;&emsp;截至 2019 年 1 月 15 日，建行手机 App 的下载量达到 7047 万次，位居行业第一，领先行业第二名的农行达 1892 万次。 &emsp;&emsp;2019 年，据新浪金融评测室测评，“建设银行 APP 交互逻辑比较顺畅，产品功能比较完备，财富管理服务、语音智能服务可圈可点。但是，APP 也有一些细节待完善，突出表现在智能助手转人工服务‘门槛’高，支持查询但不能复制卡号，不支持复制卡号激活转账等较实用的快捷转账方式”，最终给予 87.55 分（总分 100）。 2. 招行 &emsp;&emsp;招行在电子银行领域是国内银行界的先行者，早在 1999 年 9 月，招行就率先在国内全面启动 “ 一网通 “ 网上银行服务，建立了由网上企业银行、网上个人银行、网上支付、网上证券及网上商城为核心的网络银行服务体系，并经中国人民银行批准首家开展网上个人银行业务，成为国内首先实现全国联通 “ 网上银行 “ 的商业银行。 &emsp;&emsp;2010 年 7 月 27 日，招行 Android 版手机银行正式发布。其后，“招商银行”和“掌上生活”成为其手机 APP 两大主力产品。 &emsp;&emsp;2015 年，招行提出“移动优先”的发展策略。同年，掌上生活 App5.0 版推出“开放注册、全民共享”服务，在技术层面打破银行间壁垒，在行业内率先向他行持卡人全面开放，完成了互联网式的虚拟账户搭建，推动平台的扩展经营。 &emsp;&emsp;2016 年，“饭票”、“影票”迁移到“招银金融云”上，云端扩容让“掌上生活”的“饭票”每分钟可以处理超过 3 万笔的订单，月消费也突破 3 亿元，成为“掌上生活”流量最大的内容板块之一。2016 年，掌上生活 App 绑定量突破 3000 万，日活跃度破 400 万。“掌上生活”App5.5 版本推出了“e 招贷”，为满足持卡人短期因刷卡不便而产生的现金消费需求，提供最高 30 万的现金贷款，该版本可实现实时审批、实时放款，无需材料或抵押，纯 App 端申请，最快 30 秒完成申请，款项最快实时入账。 &emsp;&emsp;2017 年末，手机银行 App6.0 上线，实现了云化架构，并把手机银行拆解成 137 个独立模块，每个模块可以独立更新升级；对外开放了 1035 个功能，其中很多功能开放给合作伙伴，如一网通支付、用户认证、O2O 入口，以形成一个开放的生态；融合了包括生物识别（人脸、指纹、声纹）、智能投顾、智能风控、AR 在内的多项新技术。当年，两大 App 月活超过 4500 万。 &emsp;&emsp;2018 年，招行首次提出以 MAU 作为“北极星”指标。9 月，招行两大 App 的 7.0 版本正式迭代上线，年底则是完成了“全面无卡化改造”，由“卡时代”向“App 时代”转型。截止 2018 年末，“招商银行”与“掌上生活”两大 APP 累计用户数达到 1.48 亿，几乎将所有零售客户都转化为 APP 用户，MAU 突破 8,100 万。 &emsp;&emsp;2019 年，招行行长田惠宇在在 2018 年财报致辞中提到，“银行卡只是一个产品，App 却是一个平台，承载了整个生态”。这指明了招行手机银行的建设方向。 &emsp;&emsp;2019 年，据新浪金融评测室测评，“智能账本、城市服务进一步优化，搜索、客服等体验不断提升，服务智能化的同时也更加人性化。不过，APP 也有一些遗憾之处，比如待办事项没有自动提醒信用卡还款日、电话客服不能一键拨打、用户自定义功能键权限小”，最终给予 91.55 分（总分 100）。 3. 工行 &emsp;&emsp;2000 年 5 月工行推出 SIM 卡技术的手机银行，可为用户提供账户查询、缴费、转账与证券交易信息等服务，但用户需要把手机的 SIM 卡转换成为专门的 STK 卡，该模式并未得到市场的广泛认同。 &emsp;&emsp;之后，沉寂至 2008 年，工行首推 WAP 手机银行；到了智能机时代，工行于 2011 年推出手机银行客户端；2014 年，该行手机银行客户规模突破 1 亿，月活跃客户仍不到 1000 万。可以看出，这一时期，工行手机银行的发展比其他大型银行发力略晚。但是工行原有客户群体较大，“后劲”较足，2016 年时，该行手机银行客户规模已经突破 2 亿。 &emsp;&emsp;2015 年至 2017 年，围绕市场趋势，工行三次变革了互联网平台战略重点。2015 年首次提出“E-ICBC1.0”，构建了各类网络平台，但在带来用户量扩张的同时却缺乏全行统筹；2015 年 9 月份，“E-ICBC2.0”发布，在于合肥成立了网络融资中心，但没有设立网络金融部；2017 年，工行加码金融科技，发布 e-icbc 3.0 战略，成立网络金融部, 加强对移动 APP 的统筹管理，集中移动端入口，下架直销银行、ipad 网银等多款总行级 APP。按核心业务和场景，工行的移动端逐渐向“三融一活”（融 e 行、融 e 联、融 e 购和工银 e 生活）方向精简。 &emsp;&emsp;2017 年 6 月，该行手机银行业务笔数突破 100 亿 ; 10 月，手机银行客户规模近 3 亿，日活跃用户突破 1000 万，月均用户将近 5000 万，年活跃客户突破 1 亿。2017 年开始，工行手机银行迭代频率由原来每季度一个大版本，提升为每月一个大版本。 &emsp;&emsp;2018 年 10 月, 工行推出主打“专业、智能、安全、精选”的手机银行 4.0。进行了界面换新、贷款服务升级、智能语音交互、五大措施降门槛、安全升级加固，推出了 “随心查”（智能账务查询与分析功能）和“云保管”（个人证照在线管理）等功能。该版本实现了对工行 90% 以上业务的覆盖，可以查询 5 年以上交易数据。 &emsp;&emsp;截至 2019 年 5 月，工行四大 APP“三融一活”移动端用户规模突破 4 亿户，累计月活跃客户（MAU）突破 1 亿户，成为全球首家移动端 MAU 破亿的银行。 &emsp;&emsp;2019 年 7 月，工行推出幸福生活版手机银行，综合运用多项新技术，设计研发“适老亲老”的业务流程，让老年人享受到移动金融服务的便利，推出亲情账户，打造家庭线上金融服务。 &emsp;&emsp;2019 年，据新浪金融评测室测评，“在用户体验上有所提升，操作流畅度也不错，但仍有几个问题待解：余额变动提醒需要另外下载‘融 e 联’APP，资产 / 负债功能建设与同业有差距，客服体验不佳且人工客服‘不够温度’，温馨提示‘不够温馨’。此外，与同业相比，工商银行 APP 在产品方面具有较大优势，但各产品条线缺乏系统性功能建设”。最终给予 84.15 分（总分 100）。 4. 微众银行 &emsp;&emsp;微众银行是由腾讯公司及百业源、立业集团等知名民营企业发起设立，总部位于深圳，2014 年 12 月经监管机构批准开业，是国内首家民营银行和互联网银行。 &emsp;&emsp;李克强总理 2015 年 1 月 4 日在微众银行考察时，敲下电脑回车键，为卡车司机徐军发放了一笔 3.5 万元的网络贷款。这是微众银行完成的第一笔放贷业务。该行既无营业网点，也无营业柜台，无需财产担保，通过人脸识别技术和大数据信用评级发放贷款。 &emsp;&emsp;与传统银行不同，微众银行实际上更像一家持有银行牌照的科技公司，其技术人员占比超过 50%。有数据显示，微众银行科技经费投入占全行费用支出比例高达 30% 以上，颇具科技公司特点。 &emsp;&emsp;在技术方面， 2015 年 8 月，微众银行就采取开源技术、按分布式架构搭建技术平台，成功建成完全自主可控、可支撑亿量级客户和高并发交易的银行核心系统。截止当时，共建成 168 个关键系统、886 个子系统，共有 132 项新技术应用申请国家发明专利。微众银行成为国内首个建成“去 IOE”科技架构的银行，并拥有全部知识产权。 &emsp;&emsp;作为一家互联网银行，微众银行近 90% 的业务都已经实现云化。对传统银行而言，手机只是银行众多渠道中比较重要的渠道之一，但对微众银行而言，手机则是最主要的渠道，观察其手机银行的发展，更像是观察其整体发展。 &emsp;&emsp;2015 年 8 月 15 日，微众银行正式宣布上线微众银行 APP。通过该 APP，用户可开通微众银行电子账户，并获得一个 19 位微众卡卡号，但并无实体卡。微众银行副行长、微众银行 APP 负责人郑新林表示，此款 APP 从 2014 年底即开始着手，最终耗时 8 个月才上线。微众卡当时仅可办理存款、理财、还房贷等业务，以及在微众卡和已绑定的其他银行同名账户之间进行转账，不支持刷卡消费、给他人转账等功能。 &emsp;&emsp;2016 年 12 月起，银行业开始执行账户分类管理政策。其中全功能的 I 类账户只能在线下柜台开立。互联网银行的远程开户，只能作为Ⅱ、Ⅲ类账户。当月，微众银行上线“We 通”业务， APP 上增加 “WeCard”入口。通过该入口可申领民生银行银联借记卡“WeCard”，并在线下进行账户激活，即可直接联通民生银行借记卡，将微众银行的Ⅱ类账户关联到民生银行借记卡，以解决微众银行无法开立 I 类账户问题。 &emsp;&emsp;与传统银行相比，微众银行将其业务重点放在发展长尾客户上，产品尤其是资产端产品种类并不多，主要有 3 款： &emsp;&emsp;（1）微粒贷，由微众银行独立推出，是微众银行的核心产品，流量来源于 QQ 和微信； &emsp;&emsp;（2）微车贷，由优信二手车与微众银行合作推出，贷款申请入口在优信二手车 APP； &emsp;&emsp;（3）小微企业贷，简称微业贷，面向中小微企业。 &emsp;&emsp;上述产品均可通过手机 APP 发起申请。 &emsp;&emsp;继 2016 年实现扭亏后，2018 年，微众银行营收首次突破百亿，达到 100.3 亿元，同比增长 48.63%；净利润达到 24.74 亿元，同比上升 70.85%，是网商银行同期净利润 6.7 亿元的 3.69 倍。截止 2019 年 2 月，历史累计放款 1.9 万亿，APP 用户已达 1700 万。 &emsp;&emsp;2019 年，据新浪金融评测室测评，“微众银行 APP 界面友好，在线客服十分人性化，互动体验表现优异。在产品方面上线了存款、理财、贷款、保险等产品，种类较为丰富。但微众银行 APP 与微信和 QQ 绑定登录，对于非微信和 QQ 用户来说，操作起来并不友好”，“申请微粒贷用户无法直接在微众银行 APP 内完成借款，还需要跳转至微信才可完成。微车贷和微业贷同样也无法在 APP 内完成申请”。最终给予四星半的评分（满分五星），为民营银行 APP 评分中最高者。 三、关于对银行移动端应用的思考 &emsp;&emsp;银行不仅在 APP 开发上，也在运营上不断发力，大行都坐拥上亿用户，月活数也逐年攀升。纵观手机银行的发展历程，可以发现，多数行都是在 2010 年之后才开始逐步进入加速状态，这一方面是智能手机功能不断强化带来的硬件支撑，另一方面也是与互联网公司的“移动”战争不断升级，手机入口竞争日益激烈导致。 &emsp;&emsp;手机银行发展至今还是有些问题值得关注： （一）手机银行的战略定位 &emsp;&emsp;据 eMarketer 的研究数据显示，2018 年，美国成年人每天花在移动设备上的时间约为 3.5 小时（中国数据直观感觉上应该会更高）。在 12 个主要国家中，APP 应用程序占据了所有手机使用时间的 80% 以上。但用户的时间和注意力是有限的，根据 comScore 的数据，消费者通常会在手机上安装平均 30 个 APP，用于社交媒体、音乐、娱乐、游戏、新闻、信息、日历等用途，但 97% 的手机时间都只花在 10 个常用的 APP 上。 &emsp;&emsp;手机银行尽管发展较快，但是争夺流量入口的效果依然有限。微信、支付宝、京东等具有较强入口能力的 APP 都在逐渐平台化、重型化、生活化，并将金融功能嵌入其托起的业务场景中。而银行系，微众银行由于自身“基因”特点，平台化方向较为明显，是自身业务的主要承载渠道；招行提出了用手机 APP 替代银行卡的目标，转型意味也比较强；其他银行的手机银行尽管功能丰富，但是平台化的战略特点和方向并不十分清晰。 （二）移动用户的争夺将逐渐进入存量争夺 &emsp;&emsp;中国市场的人口红利在各个细分市场上都在逐渐消失，移动互联网也不例外。 &emsp;&emsp;2019 年 7 月 23 日，市场机构 QuestMobile 发布了中国移动互联网 2019 半年大报告。报告指出，第二季度与第一季度相比，月活跃用户下降了近 200 万，这是中国互联网用户月活首次出现下降，整个市场的人口红利逐渐消失，下沉市场将是最后一块红利。 &emsp;&emsp;银行 APP 在设计上仍有较大改进余地，缺乏有效的整体规划，纷繁杂乱的手机银行功能多数无人问津，仅体现了手机渠道的业务覆盖度，客户体验方面也普遍有待提高。这些不足对于银行在存量市场上开展竞争是不利因素。 （三）技术能力对移动端争夺依然具备决定性影响 &emsp;&emsp;随着 5G、API、开放银行等技术的发展和理念的变化，移动端对于银行获客、留客、活客的意义越来越大，不仅 C 端，B 端移动化办公的需求也越来越高。据统计，阿里钉钉目前有 2 亿终端用户，企业组织 1,000 万个，B 端场景建设之争持续升级。AR、VR、数字人类等技术为交互体验带来的革新将进一步加大渠道形态变革的力度，技术的进步甚至可能在不久的将来直接改变手机的形态，近期各大银行都在拍摄“未来银行”宣传片，其中也可见各银行对未来“手机”的设想。 &emsp;&emsp;银行在技术方面总体上属于应用而非研发的定位，那么在未来的移动“战争”中，银行很可能依然不具备从战略防御转为战略进攻的基础能力。 参考资料：1.《国外手机银行发展特点、技术历程及风险控制》，2014-03-21，李红瑞。2.《美国手机银行业分析》，2014-08-11，安华信达。3.《世界最好的手机银行西班牙 BBVA》，2017-07-21，搜狐网。4.《BBVA 数字十年》，2018-03-12，熊子川， http://www.tuzei8.com/bbva-digital-transformation/。5.《手机银行大比拼：从“卡时代”到“APP 时代”》，2019-06-12，陈思，21 世纪经济报道。6.《建行手机银行用户 7452 万高居榜首 工行紧追不舍》，2009-12-21，李山，理财周报。7.《开动创新引擎，建行手机银行实现跨越发展》，2017-10-24，建行网站。8.《坚持“移动优先” 持续建设智慧生态》，2017-03-31，方杰，中国电子银行网。9.《开动创新引擎，建行手机银行实现跨越发展》，2017-10-24，建行网站。10.《建行 2018 成绩单：手机银行用户破 3 亿，超网银用户，有一项收入大涨近 100%》，2019-03-29，中国电子银行网。11.《建行 2018 成绩单：手机银行用户破 3 亿，超网银用户，有一项收入大涨近 100%》，2019-03-29，中国电子银行网。12.《招商银行三次转型之路研析及启示》，2018-04-13，陈屹，中央广播电视总台国际在线13.2019 年 3 月 23 日，在第十届中国（深圳）金融科技发展论坛上，招商银行 CIO（首席信息官）陈昆德发表的主题演讲14.《工行移动端月活跃客户破亿 确立移动端领跑态势》，2019-06-03，中国电子银行网。15.“百度百科”，“微众银行”词条。16.《微众银行估值进化史：4 年何以超千亿？》，2018-11-05，第一财经。17.《微众银行估值进化史：4 年何以超千亿？》，2018-11-05，第一财经。18.《微众银行发布 2018 年财报：净利润 25 亿 不良率 0.5%》，2019-05-11，责任编辑贾振飞，新浪财经。19.《正在醒来的银行 App，成为超级平台，或者沉没》，2019-06-11，馨金融。20.《中国互联网月活用户首次下降 下沉市场或是最后红利》，2019-07-23，新京报。21.《打造 1×1&gt;2 的效果，蓝凌×钉钉加速赋能企业数字化转型》，2019-08-30，付媛媛，首席数字官。","categories":[],"tags":[],"author":"钰湚"},{"title":"金融科技盛宴（三）：银行的云计算应用","slug":"FintechBanquet3","date":"2019-12-31T06:38:40.000Z","updated":"2019-12-31T08:18:07.735Z","comments":true,"path":"2019/12/31/FintechBanquet3/","link":"","permalink":"http://yoursite.com/2019/12/31/FintechBanquet3/","excerpt":"","text":"一、云计算发展简介&emsp;&emsp;1963年，DARPA（美国国防高级研究计划局）向麻省理工学院提供了约 200 万美元的津贴，启动了著名的 MAC 项目，要求麻省理工开发“多人可同时使用的电脑系统”技术。当时麻省理工就构想了“计算机公共事业”，即让计算成为像电力一样供应。这个项目产生了“云”和“虚拟化”技术的雏形。 &emsp;&emsp;然而，有趣的是，尽管思想萌芽出现的很早，但直到将近 40 年后的 2006 年，“云计算”这一术语才出现在商业领域，Google、亚马逊和 IBM 先后提出了云端应用。 &emsp;&emsp;Google 一开始是为了将大量廉价的服务器组合起来支持其庞大的搜索业务；亚马逊则是因为自建数据中心后，为了将多余的空间出租出去，而推出了 EC2 (Elastic Compute Cloud) 云服务；IBM 则是在从硬件制造商转型为企业级软硬件整体解决方案供应商的过程中，逐渐形成云服务能力，与 2007 年推出了 Blue Cloud 服务，但是最终，起步并不晚的 IBM 却错失了“云计算”的快车；2008 年，微软在其开发者大会上发布了 PaaS 云计算平台──Azure Service Platform。 &emsp;&emsp;我们今天理解的“云计算”实际上只有十二三年的时间，比区块链技术的历史略长，但是，这短短的十二三年时间，已经使“云计算”成为了可有效驾驭庞大计算资源的成熟技术，其发展速度不可谓不快。 &emsp;&emsp;时至今日，从服务类型上分，云服务可以分为 IaaS、PaaS 和 SaaS 三种类型，分别对应只提供基础设施、提供完整开发环境和提供成品云端软件三种服务方式；从部署模型上分，主要有公共云、社区云、私有云和混合云，公有云是第三方提供者拥有的可公共访问的云环境，社区云则仅供一组社区成员访问的云环境，私有云是仅供一个组织所拥有的云环境，混合云则是采用以上两种或多种部署模型组合部署的云环境。 &emsp;&emsp;国内云计算市场发展很快。国际数据公司 （IDC）发布的《中国公有云服务市场（2018 下半年）跟踪》报告显示， 2018 下半年中国公有云服务整体市场规模（IaaS/PaaS/SaaS）超 40 亿美金，其中 IaaS 市场增速再创新高，同比增长 88.4%，PaaS 市场增速更是高达 124.3%，增速远高于全球。相比 2014 年，2018 年中国公有云 IaaS 市场对全球的贡献份额已翻倍，达到 46.5 亿美元。2018 年，公有云市场后发厂商频频发力，华为、百度、浪潮、京东等均得力于其强大的研发和生态实力，实现了高达市场平均水平 2-8 倍的迅猛增长。 &emsp;&emsp;2019第一季度中国公有云服务整体市场规模（IaaS/PaaS/SaaS）达到 24.6 亿美金，同比增长 67.9%。其中，IaaS 市场增速有所减缓，同比增长 74.1%；PaaS 市场依然保持高增长，增速为 101.9%。 &emsp;&emsp;阿里、腾讯、中国电信、亚马逊（AWS）位居前四，总共占据 70.2% 的市场份额；金山、华为和百度市场规模接近，随着一季度华为和百度 IaaS 业务的快速增长，三家厂商均录得了第五位（5.2%）的市场份额。 二、国外银行的云计算应用（一）荷兰国际集团（简称 ING） &emsp;&emsp; ING 是由荷兰最大保险公司 (Nationale-netherlanden) 与荷兰最大的邮政银行 (NBM) 合并而成，已有 155 年历史。 &emsp;&emsp;2008 年，该银行认为自己的数据中心管理方式已经过时而且低效，成本远高于市场平均水平，于是，启动了云计算项目。在第一阶段，该银行废除了 13 家数据中心，对 6000 多台服务器和 350 多个应用进行了虚拟化。2011 年初，该银行建成了连接 6 个数据中心的私有云。其后，进一步投资了混合云技术。2015 年，在云化基础上，该银行进一步升级了其持续交付基础设施，为全行转型敏捷开发、DevOps 模式奠定了基础。目前，该银行已经成为整体敏捷转型实践的范例。 （二）德意志银行 &emsp;&emsp;2015 年 2 月，HPE 与全球最大的老牌银行之一德意志银行达成合作，签署的长达十年的云计算项目，部署一系列的私有云和公有云解决方案，这将作为这家银行长期 IT 转型的一个重要步骤。 &emsp;&emsp;德意志银行正在执行一个长达 10 年的长期 IT 转型战略，这一战略的命名是：Project Nucleus——战略转型“核战略”。顾名思义，德意志银行对这一战略寄予极高的期望，总预算高达数十亿美元，目标是将德意志银行的全球 IT 环境进行升级换代，从而实现 IT 基础架构的成本降低，德意志银行的 IT 部门将从成本中心转变为运营中心。 &emsp;&emsp;HPE 主要为德意志银行的批发银行业务的 IT 架构提供私有云产品和解决方案，其中包括存储、平台、和托管业务。HPE 托管私有云整体解决方案将入驻德意志银行全球约 20 个数据中心，包含按需计算资源、定价策略等，这也将改变德意志银行的运行机制。 （三）西班牙对外银行（简称 BBVA） &emsp;&emsp;BBVA 较早采用了谷歌通过的云方案，以提高生产效率，在 2012 年底，其分布在全球 26 个国家或地区的超过 11 万名员工已经通过云服务进行协作与沟通。2016 年 BBVA 分别与 Red Hat、Amazon Web Services 合作，着力提升其云平台管理、云部署、云计算能力，并搭建云基础架构与创建云社区。 三、国内银行的云计算应用（一）建行 &emsp;&emsp;2012 年开始，建行率先进行了尝试，成为国内第一家在生产数据中心大规模应用私有云的商业银行。当年，建行成立了云平台规划组，对云计算技术进行研究。2013 年 8 月建行私有云平台项目成功上线，有效地支持了新一代核心系统长达六年的建设和投产历程。该项目也荣获了 2013 年度银监会“银行业信息科技风险管理课题研究”一等奖、“2013 年中国金融信息化年度十件大事”以及“IDC2014 年度中国金融行业最佳（唯一）创新大奖”。 &emsp;&emsp;建设银行云管理平台参考了开源项目 OpenStack 的架构设计，并根据商业银行数据中心运维的特点进行了适当的扩展，主要增加了和运维有关的日常检查、软件分发、配置管理和服务启停等功能模块。在技术架构方面，主要由用户门户、服务管理、流程引擎、消息总线和资源适配五部分组成。实践过程中，建行对大量产品进行了抽象化和标准化的工作。 &emsp;&emsp;随着建行对“金融科技”战略的推进，基于私有云的成功运行经验，对外科技输出的范围不断加大。2018 年下半年，建行开始对同业提供建行云服务，产品丰富多样，涉及计算、存储、网络、数据库等基础服务，还包括行业应用、银行业务等多种解决方案。 （二）工行 &emsp;&emsp; 云计算实施一般会经历从数据大集中到资源虚拟化再到云计算的路径。工行 1999 年完成了数据大集中，2008 年开始部署服务器虚拟化，2014 年启动云计算的研究工作。 &emsp;&emsp;工行基础设施云 IaaS 是基于开放的 OpenStack、SDN 之上，自主研发云管平台，实现了计算、存储、网络资源的供应，与应用平台云 PaaS、流程管理等系统的联动以及资源的可视化管理。应用平台云 PaaS 则采用轻量级容器技术，引入业界主流的容器集群编排及调度技术 Kubernetes。 &emsp;&emsp;截至 2017 年 12 月，基础设施云 IaaS 实现了研发云、测试云和生产云的部署，完成个人网银、企业网银等 11 个重点应用 3800 多个节点入云实施；应用平台云 PaaS 落地应用超过 40 个，云上服务调用量日均超过 5 亿笔，主要涉及互联网金融、合作方、物联网和主机业务下移等相关场景。针对以互联网金融接入带来的业务突发高峰场景，云平台的弹性扩展和高可用能力支撑了工行 2016～2017 年的纪念币预约、春节红包、“双 11”大促等互联网高并发场景，在生产经历了上万 TPS 的瞬时高峰考验。 （三）中行 &emsp;&emsp; 中行在 2018 年 8 月 9 日银行业例行新闻发布会上介绍了该行“加快金融科技创新，全面推动数字化转型”的相关情况。中行首席信息官刘秋万表示，2018 年，中行将完成云计算平台、大数据平台、人工智能平台等三大技术平台建设，全面推动技术架构由集中式架构向分布式架构转型，为数字化发展提供有力的技术支撑。 &emsp;&emsp;在云计算平台方面，私有云平台一期于 2018 年三季度完成部署实施。先后完成微信银行等 41 个分布式应用系统建设与改造工作。同步推进主机查询类交易下移和小型机平台应用迁移工作，累计实现下移 MIPS 28000 左右，占全部核心系统交易比例 58% 以上，已完成 17 个应用系统由小型机平台迁移至 X86 平台。 （四）中国邮政储蓄银行 &emsp;&emsp;2018 年 8 月 24 日，在金科创新社和 IBM 联合举办的 2018 新一代金融云平台沙龙上，中国邮政储蓄银行（以下简称“邮储银行”）数据中心高级工程师穆冬生先生介绍了邮储银行的云计算应用情况。 &emsp;&emsp;邮储银行是从 2014 年底开始尝试云计算技术，首先在广州的一个消费公司示范；2016 年通过四大类的开发测试项目和电子渠道的项目，夯实了云技术平台的架构体系，并将手机银行迁移到云；2017 年在云上部署大数据相关应用；2018 年开始进行是负债和资产等核心业务系统上云。云上的整体交易量在行内业务中的占比达到约 60%。 &emsp;&emsp;邮储银行云架构是基于 Mirantis OpenStack 的私有云，中间层也在不断尝试容器化推送。 （五）平安&emsp;&emsp;平安科技从 2013 年年底开始筹备云平台建设，并从 2014 年逐步构建平台和应用试点。 &emsp;&emsp;在架构上，平安云先是采用公有云的服务设计和架构方式来做私有云，比如在设计之初就实现多租户，平安内部有很多的专业公司，专业公司下面还有不同部门和项目组，这些基层组织在云上都是租户。此外，还采用了 VPC（虚拟私有云）的方式，把租户和租户之间通过网络进行隔离开。这种架构设计使平安云比较顺利地实现了后续向公有云方向的发展。 &emsp;&emsp;在底层技术框架上，平安最开始用的是 CloudStack，在使用过程中也融入了一些 OpenStack 的模块，相当于把 CloudStack 和 OpenStack 的相应模块整合在一起。在五年多的持续使用过程中，逐渐构建起平安自己的 PAStack（也叫做平安 Stack），形成了平安自己的一套框架。平安云从 14 年底 开始尝试容器技术，提出了 CaaS 设计理念，目前应用重点仍放在 Kubernetes 上。 &emsp;&emsp;2015 年底，平安私有云搭建完成；2016 年初，平安提出平安云要从对内服务转变为对外服务，要做最专业的金融公有云；2017 年年中，平安正式对外发布了平安公有云；2017 年底平安集团的又进行了新的业务战略调整，在金融行业之外，增加了医疗和智慧城市两个方向。 &emsp;&emsp;平安云逐渐从私有云演变成行业云，由于其服务的行业均为强监管行业，因此在云平台构建上应用了很多隔离技术，使整个云平台可以支撑不同的行业。为了应对政府对数据安全性的高要求，采用了不同的管理方式，托管和专区都有，以满足不同行业对数据安全性上的各种特殊要求。 &emsp;&emsp;国内大型银行多采用在原有数据中心的基础上，从私有云做起、自建平台的云计算实施路径，中小型银行中虽然也有少部分银行自建平台，如江苏银行（2017 年 6 月 26 日投产）、中原银行（2018 年 9 月 29 日招标），但大多数银行难以负担高昂的数据中心建设成本，其中少数行采用采购云服务的方式实现业务上云。 四、关于对银行云计算应用的思考 &emsp;&emsp;国内外大型商业银行在云计算方面都是从原有的数据中心经过技术改造转型为云架构，也多是采用私有云建设方案，尤其是国内大型银行。目前随着公有云技术的发展，也有越来越多的银行在考虑公有云、混合云方案。但是云计算目前依然存在以下两个“恼人”的问题： （一）稳定性 &emsp;&emsp;金融级应用最核心的诉求就是稳定性。目前公有云的头部科技企业虽然技术发达，但是中断依然时有发生，仅 2019 年，截止 8 月份已经有多个“巨头”出现宕机故障。 &emsp;&emsp;国外方面。2019 年 5 月 2 日，由于 DNS 配置事故，微软的 Azure 云在全球范围内震荡不定，平台范围的中断已经破坏了世界各地的各种 Redmond 托管系统，故障修复时间大约为 3 小时；6 月 3 日，美国东部发生网络拥堵，影响到 Google 云计算服务、G Suite(在线邮件以及企业生产力套件) 服务、YouTube（国外版优酷）网站服务，根据 Google 的报告，宕机事故始于美国太平洋时间 6 月 2 日 12:25，到下午 4 点服务全部恢复；6 月 19 日，IBM 的 Icloud 出现大约 1 小时的较大范围中断，包括美国东海岸、欧洲、澳洲等地区受到影响，导致门户和 API 不可用；日本亚马逊 AMAZON AWS 云端伺服器 8 月 23 日中午开始出现大规模异常，许多使用相关服务的日本手机游戏纷纷出现连线异常状态的 lag 或是读取时间过长，部分游戏甚至完全无法进行游玩，影响用户上百万用户的使用。 &emsp;&emsp;国内方面。2019 年 3 月 3 日，阿里云出现宕机故障，事故持续了 3 个小时左右，事后观察了 2 个小时，这不是阿里云首次出现宕机故障；3 月 23 日 16 时左右，腾讯服务器发生了大规模宕机，有网友发微博称旗下《王者荣耀》、《刺激战场》等多款热门游戏和网络服务产品“集体阵亡”，据称故障原因为光缆被挖断，故障恢复时间为 3 小时左右；7 月 24 日，腾讯云广东区域部分用户出现资源访问失败、控制台登录异常等情况，经排查，确定该故障是因腾讯云广州一区的主备两条运营商网络链路同时中断所导致，故障造成服务中断 4 小时。 &emsp;&emsp;尽管“巨头”在调流分流、弹性伸缩方面都“身怀绝技”，但是仍难免出现这些问题。上述级别的故障对于金融企业而言是难以接受的，尤其是国内人民银行对信息安全事件分类和报告制度有着非常严格的规定，出现问题的金融机构会面临严厉的监管问责。 &emsp;&emsp;目前除了中小银行只能通过公有云方式实现“上云”外，一些大型银行也在对同业金融机构提供公有云服务，因此，需要时刻注意云的稳定性问题，可用性无论达到多少个“9”，故障率依然不会是“0”，必须做好应急预案以保证业务连续性。 （二）安全性 &emsp;&emsp;金融级应用无法忽视安全性，尤其是数据安全。近年来，针对云服务器进行攻击而导致的数据泄露事件依然时有发生。 Equifax 数据泄露事件&emsp;&emsp;2017 年 7 月 29 日，美国最大征信机构 Equifax 发生数据泄露事件，波及约 1.43 亿美国用户，泄露数据包括驾照号、社保号、出生日期和地址。黑客通过利用广泛使用的开源 Web 服务器软件 Apache Struts 中的漏洞，盗窃了 Equifax 系统中的数据。Equifax 总共犯了 34 个控制与过程错误导致数据泄露。可能只需其中 5 个控制措施和过程做对了就能避免这场数据泄露。其他 29 个左右可以尽早检测到数据泄露情况，留出时间加以阻止。&emsp;&emsp;Apache Struts 在“财富 100 强”企业中应用广泛，但该事件发生后，尽管该漏洞已被广泛宣传，开源自动化公司 Sonatype 提供的数据显示，只有五分之一的公司不再使用该软件的易受攻击版本，大量的用户仍然没有将软件升级或者安装补丁文件。&emsp;&emsp;2019 年 7 月 22 日，Equifax 宣布接受金额创纪录的和解协议，了结了这桩最终导致 1.5 亿人个人信息及财务记录暴露的大规模数据泄露事件。Equifax 需支付至少 13.8 亿美元的消费者索赔金。受泄露事件影响的消费者可得到现金补偿、信用监视和身份恢复帮助，所需资金由该公司投注的 3.805 亿非复归基金支出。协议还要求 Equifax 另外支付 1.25 亿美元的现金赔偿，且如果报名信用监视的人数超过 700 万，该公司需支付的数额还将大幅增加。&emsp;&emsp;此外，Equifax 还需支付 1.75 亿美元的罚款以平息州检察官的调查，美国消费者金融保护局和联邦贸易委员会 (FTC) 的调查也需 1 亿美元平复。&emsp;&emsp;最后，未来五年内，Equifax 还必须拿出 10 亿美元改善其数据安全。而且，这还是在 Equifax 自事件发生后已在安全及技术方面投入 12.5 亿美元的基础上。 第一资本银行 (Capital One) 数据泄露事件&emsp;&emsp;2019 年 7 月 29 日，据美国媒体报道，Capital One 当天发布声明称数据库遭黑客攻击，约 1.06 亿银行卡用户及申请人信息泄露。遭到泄露的数据主要是 2005 年至 2019 年初期间，个人客户以及小型企业在申请信用卡时提交的各项信息，其中包括约 14 万个社会安全号码和约 8 万个银行账户号码，以及一部分用户的信用评分和交易记录。&emsp;&emsp;犯罪嫌疑人名为佩奇·汤姆森 (Paige Thompson)，曾经在亚马逊公司担任网络服务工程师。美国检方称，汤姆森利用 Capital One 系统防火墙的漏洞，通过攻击该银行租借的云计算服务器进入数据库。据 CNN 报道，汤姆森曾在美国代码存放网站和开源社区 Github 上放出她窃取的数据。据《华尔街日报》称，此次泄漏事件可能给该银行带来 1 亿至 1.5 亿美元的损失。 富国银行数据中心因出现故障导致宕机&emsp;&emsp;太平洋时间 2019 年 2 月 8 日早上 6 点左右开始，美国第四大银行 Wells Fargo 的在线门户网站及移动应用软件已完全无法使用，报道称富国银行的银行卡被众多收银机和商店拒绝。该银行在一份声明中表示：“我们遇到了系统问题，原因是我们的一个数据中心出现了电源关闭，在日常维护后检测到烟雾后启动了断电机制。我们正在努力尽快恢复服务。我们对于给您带来的不便深表歉意”。&emsp;&emsp;灭火系统往往会对数据中心的机器、尤其是硬盘驱动器造成相当大的破坏。恢复电源并消除灭火系统的影响可能需要一段时间。故障出现后，云计算服务随之瘫痪，富国银行在美国全境出现持续了数小时的大规模宕机。由于缺乏更进一步的信息，该事件如何引发了连锁反应，影响了这家银行面向互联网的整套基础设施尚不得而知。 2019 年发生的其他产生较大影响的泄漏事件&emsp;&emsp;安全研究专家特洛伊·亨特 ( Troy Hunt ) 在博客中称，在云存储服务平台 MEGA 上，被黑客公开了窃取的 7.73 亿个电子邮件地址和近 2200 万个密码，这些文件一共超过 1.2 万份，数据超过 87 GB；因服务器出现安全漏洞，IT 安全和云数据管理巨头 Rubrik 的数据库遭到泄露，该数据库存储了近 10GB 的数据，包括每个客户的姓名和联系方式等；一位名为 Andrew 的黑客在 Pastebin 网站上叫卖领英网站 1 亿 5900 万用户的敏感数据，为了表示数据的真实性，该黑客已放出 100 名用户的登录凭证，其中甚至包括知名 CEO 的登录数据；荷兰非盈利机构 GDI 基金会研究人员发现，位于深圳的某人脸识别公司发生大规模数据泄露事件，超过 250 万用户的 680 多万条信息记录被泄露，泄露数据包括身份证信息、人脸识别图像、24 小时内的位置记录等敏感信息。 国内云平台安全形势依然严峻&emsp;&emsp;据新华社报道，国家互联网应急中心 2019 年 8 月 13 日发布的《2019 年上半年我国互联网网络安全态势》显示，2019 年上半年，发生在我国云平台上的网络安全事件或威胁情况相比 2018 年进一步加剧。&emsp;&emsp;根据国家互联网应急中心监测数据，发生在我国主流云平台上的各类网络安全事件数量占比仍然较高，其中云平台上遭受分布式拒绝服务攻击（DDoS 攻击）次数占境内目标被攻击次数的 69.6%，被植入后门链接数量占境内全部被植入后门链接数量的 63.1%，被篡改网页数量占境内被篡改网页数量的 62.5%。&emsp;&emsp;报告指出，攻击者经常利用我国云平台发起网络攻击，其中利用云平台发起对我国境内目标的 DDoS 攻击次数占监测发现的 DDoS 攻击总次数的 78.8%，发起对境内目标 DDoS 攻击的 IP 地址中来自我国境内云平台的 IP 地址占 72.4%，承载的恶意程序种类数量占境内互联网上承载的恶意程序种类数量的 71.2%，木马和僵尸网络恶意程序控制端 IP 地址数量占境内全部恶意程序控制端 IP 地址数量的 84.6%。&emsp;&emsp;稳定性和安全性对金融级应用非常重要，一旦发生问题，对金融机构而言影响极大。当然，上述例子并非是要银行因噎废食，而是银行在云计算方面依然需要不断提升技术能力。总所周知，即便是大型银行，其场景并发量当前仍比互联网科技公司低至少一个数量级，所以在云计算的基础技术领域比后者还是稍差一些。当银行不断寻求云上业务规模的拓展时，也必须注意到规模产生的复杂度，无论是在调流限流、降级、弹性伸缩、多活等技术上，都需要不断加强。安全性则始终是一个“道高一尺魔高一丈”的循环过程，私有云安全保护程度相对还是要高于公有云，而希望提供公有云服务的银行，需要格外注意加强安全管理。 参考资料：1.《云计算定义、发展史及三个层次详解》，网优雇佣军，2017-12-02，电子发烧友网。2.《云计算概念、技术与架构》，Thomas Erl、Zaigham Mahmood、Riccardo Putttini，2017 年 7 月，机械工业出版社。3.《金融服务业的云计算》，2019-06，伯纳多·尼克莱蒂著，陈冰翻译，经济管理出版社。4.《HPE Helion 云计算成为德意志银行数字化转型的核心力量》，2015-11-03，huipuyunxitong 的博客。该博客文章部分内容引自著名研究机构 451Research 发布的研究报告《HP cloud is at the center of Deutsche Bank’s digital transformation》，原文作者：451Research 分析师 William Fellows。5.《金融服务业的云计算》，2019-06，伯纳多·尼克莱蒂著，陈冰翻译，经济管理出版社。6.《开放银行：国际范式与中国实践》，2019-06-14，杨望、王姝妤，瀚德金融科技研究院。7.《云计算技术研究——中国建设银行私有云探索与实践》，2017-12-28，全国金融标准化技术委员会。8.《工商银行金融云如何助推工行“智慧银行”建设》，2018-05-16，中国工商银行软件开发中心副总经理 王雍，金融咨询网。9. 中国银行：2018 年将完成云计算、大数据三大技术平台建设》，2018-08-09，胡爱善，中国网财经。10.《Equifax 的问题出在哪里：34 项控制与过程失误》，2018-12-07，安全牛。11.《Equifax 数据泄露一年后，500 强公司仍然在使用相同有缺陷的软件》，2018-05-11，企鹅号：过去未来现在化。12.《亿级美元已是常态：迄今为止损失最大的数据泄露盘点》，2019-08-11，安全牛。13.《美国第一资本银行数据库遭黑客攻击 超 1 亿用户信息泄露》，2019-07-30，中国新闻网。14.《富国银行眼下乱成一团糟：数据中心被烟雾笼罩，银行网站和应用软件宕机》，2019-02-08，云头条。15.《2019 上半年度重大数据泄露事件盘点》，2019-07-15，骇极安全。","categories":[],"tags":[],"author":"钰湚"},{"title":"金融科技盛宴（二）：银行的区块链应用","slug":"FintechBanquet2","date":"2019-12-31T06:37:20.000Z","updated":"2019-12-31T07:02:12.054Z","comments":true,"path":"2019/12/31/FintechBanquet2/","link":"","permalink":"http://yoursite.com/2019/12/31/FintechBanquet2/","excerpt":"","text":"&emsp;&emsp;2019年6月18日，Facebook 发布消息称计划发行一种名为“Libra”的稳定币，通过 Libra 为全球超过十亿人提供普惠金融服务，Libra 让已经略感平静的区块链湖面顿时活跃。从比特币到 Libra，区块链技术走过了一个十年的轮回，从金融出发再回到金融。虽然目前 Libra 前途尚无定论，但是，它已经让全世界广泛、一致地深度思考了区块链技术对金融行业的改变能力。Libra 是对区块链技术经典目标的回归，而且非常强势。&emsp;&emsp;《环球时报》英文版针对 Libra 发表的评论文章指出“全球数字货币竞争时代，中国不能缺席”，“随着全球数字经济竞争时代的到来，中国产业和监管机构都有必要就数字货币进行更多对话，理解甚至是鼓励数字货币。否则，中国有可能会在新的金融格局中落后”。&emsp;&emsp;人民银行2019年8月2日召开的工作会议中，也明确提出要加快我国法定数字货币的研究步伐。2019年9月，国务院发布的《关于支持深圳建设中国特色社会主义先行示范区的意见》中也指出，“支持深圳开展数字货币研究与移动支付等创新应用”。&emsp;&emsp;那么在区块链走过的这十年中，银行到底用的怎么样呢？我们一起来看些国内外银行的实际用例吧。 一、国外银行的区块链应用 &emsp;&emsp;国外银行中，在区块链技术方面的领军者应当非摩根大通莫属。摩根大通较早入局区块链领域，其主持研发的 Quorum 平台是企业以太坊联盟（EEA）公认的技术代表。在 Quorum 的基础上，摩根大通 2017 年 10 月推出了 IIN（Interbank Information Network）平台，实现跨行信息交互，目标直指 SWIFT。摩根大通、加拿大皇家银行、澳大利亚 ANZ 银行、新西兰银行等相继加入该平台，到 2019 年上半年，已经有超过 200 家银行宣布加入 IIN，IIN 计划于 2019 年三季度启动。 &emsp;&emsp;2019 年 2 月，据 CNBC 报道，摩根大通将在几个月内启动测试，以推出加密货币 JPM Coin，其机制为挂钩美元的稳定币。计划面向经过监管审查的大机构客户发行，用于实现批发支付业务客户之间的实时交易结算。理论上可以与 IIN 结合完成跨境支付。摩根大通是美国首个计划发行虚拟货币的大型商业银行。 &emsp;&emsp;2019 年 5 月 27 日，韩国历史最悠久的银行——新韩银行推出了一个支持区块链的贷款平台，该系统旨在提高带流程的时间效率。作为韩国第二大银行，该行一致在积极采用区块链技术，此前，还曾实施了基于区块链的利率掉期交易。 &emsp;&emsp;2019 年 6 月，据金融科技新闻媒体 Finextra 报道称，意大利银行业协会（ABI）宣布将部署区块链技术，并从 2020 年 3 月开始采用区块链技术进行银行间对账。此举是 Spunta（意为“检查”）项目的一部分，旨在提高银行同业之间沟通的透明度和效率。2018 年 10 月，该项目完成首轮测试，验证了区块链和智能合约的应用，最近一轮测试于 2019 年 2 月顺利完成。同月，意大利众议院批准了一项定义 DLT 和区块链的法案，明确智能合约必须遵守的技术标准。 &emsp;&emsp;2019 年 6 月 18 日，汇丰银行公告称其已在印度企业客户的应收账款基础设施中采用了代币化技术。汇丰银行的数字应收账款工具（HSBC DART）是基于一家澳大利亚区块链金融科技公司的代币化技术开发的。汇丰银行曾在报告中称，在外汇交易中实施区块链技术可为其降低 25% 的运营成本。 &emsp;&emsp;2019 年 7 月底，菲律宾国内的大型商业银行——菲律宾联合银行推出了名为 PHX 的基于区块链技术的稳定币，挂钩该国法定货币“比索”，以该行储备为后盾，专注于支付业务，其最终目标是支持菲律宾中央银行所倡导的“数位普惠金融（Digital Financial Inclusion）”。该行目前与新加坡第二大银行华侨银行达成了合作，将代币化的法定货币，从新加坡汇到位于菲律宾南苏里高的坎蒂兰银行，成功实现了菲律宾运用区块链技术进行跨境汇款的首次尝试。 &emsp;&emsp;国外银行业整体上来看，对区块链技术是持积极态度的，有“币”和无“币”的应用都在尝试，也在着力用区块链技术对传统金融行业中存在的一些弊端进行改革。 二、国内银行的区块链应用 &emsp;&emsp;国内银行业较早的区块链应用当属邮政储蓄银行在 2016 年通过 Fabric Hyperledger（超级账本）在资产管理业务中实现的多方信息交互，即资产管理方、投资管理方、托管方之间通过区块链平台连接，通过智能合约提高指令执行速度，从而改善了原来各方之间靠邮件、电话进行指令交互的低效局面。之后，国内银行纷纷尝试各类应用。 （一）工行 &emsp;&emsp;2017 年初，工行参与了央行数字货币的发行和基于区块链的数字票据交易平台的研究工作；同年 3 月，工行完成基于区块链技术的金融产品交易平台原型系统建设，在其平台上为客户提供点对点的金融资产转移和交易服务；同年 5 月，工行的区块链与生物识别实验室启动与贵州省的脱贫攻坚基金区块链管理平台，在贵州省政府的支持下，工商银行与贵州省贵民集团合作，通过银行金融服务链和政府扶贫资金行政审批链的跨链整合与信息互信，以区块链技术的“交易溯源、不可篡改”实现了扶贫资金的“透明使用”、“精准投放”和“高效管理”。 &emsp;&emsp;2018 年 11 月 20 日，工行成功发放首笔数字信用凭据融资。工行联合核心企业及第三方供应链金融服务平台，利用区块链技术，将核心企业与各层级供应商间的采购资金流与贸易流集成到区块联盟平台上，相当于核心企业用数据交换信用评级。供应链上任意一个持有应收款数字凭据的供应商均可在线向工商银行提出融资申请，申请指令经工商银行智慧信贷平台批准后，贷款可瞬间到达企业账户，有效缓解了处于产业链末端、实力较弱企业的资金压力。 &emsp;&emsp;2019 年 5 月，雄安新区管委会正式启动运行的雄安征迁安置资金管理区块链平台，将应用工行区块链技术，以实现征迁原始档案和资金穿透式拨付的全流程链上管理。 （二）农行 &emsp;&emsp;2017 年 8 月，农行与趣链科技合作，推出基于区块链的涉农互联网电商融资系统——“e 链贷”。该产品利用区块链技术向电商供应链的法人客户提供完整电商融资服务，以解决长期以来涉农信贷业务的信息不对称、管理成本高等难题。农行还基于区块链技术构建了掌银客户数字积分体系（简称“小豆”），以各类权益激励客户更多地体验掌银重点功能和服务。据统计，至 2018 年 8 月，“小豆乐园”上线一年之际，累计参与客户超过 1300 万。 &emsp;&emsp;2018 年，农行推出了应用区块链技术的企业年金项目，通过把企业年金业务全流程信息上链，实现业务各参与方之间信息共享，提升数据处理效率。通过构建可信联盟链，增强了交易可信度，缩短了处理时间，由原来 12 天缩短为 3 天。 &emsp;&emsp;农行也参与到了雄安区块链“战团”之中，与雄安集团合作开发区块链电子票据系统，支持该集团在区块链资金管理平台推行电子银行承兑汇票业务，用于新区项目整个链条的支付结算，从而实现招投标管理、支付结算、供应链融资融信等全面金融服务创新。 （三）中行 &emsp;&emsp;2017 年 1 月，中行曾上线区块链电子钱包（BOCwallet）的 iOS 版本，该钱包地址由 32 位的数字 + 英文字母组成，用户可绑定个人在该行的银行卡号；同年 6 月，中行与腾讯合作，测试区块链技术；同年 8 月，中行与 SWIFT（环球银行金融电信协会）组织和全球银行一起加入 SWIFT gpi 区块链概念验证，以促进金融在 SWIFT gpi 项目中的应用。雄安新区可谓是中国区块链技术应用集中地，中行在其中参与了新区土地征迁系统、区块链资金管理系统、建设者信息管理平台、雄安集团智慧森林系统、雄安集团招投标系统等开发建设工作。截至 2019 年 3 月，已累计参与 10 万亩苗景兼用林、容东截洪渠、截洪渠景观林等新区招投标项目，累计营销 47 家总包及分包开户上链，为中标企业提供直连服务。 （四）建行 &emsp;&emsp;2017 年 9 月，建行与 IBM 合作，在香港开发和推出了一个“区块链银行保险平台”，为其零售和商业银行业务提供服务；同年 11 月，建行完成首笔区块链福费廷交易，金额近 1 亿元，成为国内首家将区块链技术应用于国际保理业务的银行。该系统逐渐演化为区块链贸易金融平台，实现国内信用证、福费廷、国际保理、物流金融等产品端到端全流程在线处理。截至 2018 年末，该平台累计交易金额超过 2000 亿元。 &emsp;&emsp;2018 年，建行率先成立雄安新区服务建设小组，并在当地建立中国建设银行河北雄安分行。2018 年 2 月上线的雄安区块链租房应用，建行就是其中参与者之一。 &emsp;&emsp;2018 年 9 月 29 日，建行搭建了“区块链金融精准扶贫平台”，积极推进金融科技和精准扶贫相结合，实现对精准扶贫资金的透明使用、精准投放和高效监管。 &emsp;&emsp;除上述外，建行在慈善业务、药品溯源等领域也上线了一些区块链项目。 （五）平安 &emsp;&emsp;2016 年，马明哲在平安集团执委大会宣布，区块链将是平安未来进军的重点。同年 4 月，中国平安正式加入 R3 分布式分类账联盟，也是中国首家加入该联盟的金融机构。 &emsp;&emsp;2018 年 2 月，平安发布面向金融行业区块链解决方案的壹账链 BaaS 平台。 &emsp;&emsp;2018 年 9 月，由平安提供技术支持的香港金管局的融资平台项目正式上线。 （六）微众银行 &emsp;&emsp;2016 年 5 月，微众银行联合 20 多家机构发起成立了金融区块链合作联盟（深圳），着力推动区块链技术研发和应用落地。其后，金链盟成员扩充至六大类行业、近 100 家机构。同年 8 月，微众银行联合上海华瑞银行推出微粒贷机构间对账平台，这也是国内首个在生产环境中运行的银行业联盟链应用场景。 &emsp;&emsp;2017 年，微众银行联合万向区块链和矩阵元共同研发了区块链开源平台（BCOS），并联合金链盟的多家成员机构共同研发了 BCOS 的金融分支版本—FISCO BCOS，两大平台现已完全开源，促进了国内开源区块链生态圈的形成。 &emsp;&emsp;2017 年 10 月，微众银行联合广州仲裁委、杭州亦笔科技三方基于区块链技术搭建了“仲裁链”，通过区块链分布式存储、加密算法等特点，为司法提供真实透明、可追溯的实时保全数据。2018 年 2 月，广州仲裁委基于“仲裁链“出具了业内首个裁决书，标志着区块链应用在司法领域的真正落地并完成价值验证。2018 年 11 月 12 日，FISCO BCOS 在 2018 年新加坡金融科技节，完成了其首次海外亮相。 &emsp;&emsp;微众银行此后将工作重点放在区块链平台建设和生态培育上，并于 2019 年 3 月 20 日，FISCO BCOS 开源社区正式发布 FISCO BCOS 2.0。 &emsp;&emsp;由于篇幅有限，本文不再一一介绍各银行的区块链应用。 三、关于银行在区块链应用方面的思考 &emsp;&emsp;区块链技术最初被“中本聪”实现时，的确是以对现有金融体系的变革为目标，这一点无论在其白皮书还是比特币创世区块中都有体现，但是十年来，区块链技术依然是争议不断，而且在落地应用方面鲜有突破。 &emsp;&emsp;银行目前的区块链应用，除了国外少数银行有涉及数字货币的应用外，国内外大部分银行对区块链技术的应用都是无“币”类应用，只是在突出区块链防篡改的数据加固能力，这是当前区块链应用方面最主要的问题，因为区块链技术并不具备强大的数据存储能力，比特币、以太坊、Libra 践行的都是尽可能最小化数据的设计方式。尽管应用者可能“财大气粗”，不在乎资源方面的消耗，但这并不是优秀设计该遵循的原则。 &emsp;&emsp;笔者认为，银行的区块链应用应该多思考以下几点： （一）没有充分利用“信任” &emsp;&emsp;区块链不是理想的数据存储方式，更不是支持大数据应用的理想方式。区块链起到数据加固作用，链上数据不易篡改，但是，银行采用区块链技术后并没有因此而简化业务流程、改变产品形态。比如，供应链、贸易融资领域都是当前区块链应用热点，信用证、福费廷、保理等业务都已经可以上链，但是链上的金融产品没有多少变化，只是改变了业务信息的传递方式。 &emsp;&emsp;如果深入思考，其实供应链、贸易金融等领域金融产品众多，并非是因为客户需求多，客户只用一个需求——资金。不同的金融产品实际上是为了解决不同场景下的信息不对称问题。既然公认区块链可以解决数据篡改问题，提供“信任”，那么，金融产品的种类应该明显减少，因为没有那么多的信息不对称能要解决了，例如，为什么还需要信用证这个产品呢？ &emsp;&emsp;众多的供应链金融产品也许可以整合成一种基于金融产品关键数据和智能合约的区块链金融产品，以对应客户其实从未变化过的核心诉求。金融产品关键数据包括：甲乙方唯一标识、合约唯一标识、金额、期限、价格、担保方唯一标识、担保率、抵质押品唯一标识、抵质押价值、有无追索权、合约状态。 &emsp;&emsp;银行只需要采用一种简单的产品合约，关联仓单等金融产品用到的链上信息，发生融资、偿还等行为时则修改链上信息与参与方的关系，这样的方式，智能合约也更容易实现。 &emsp;&emsp;从区块链的视角看，不应该有复杂的金融产品，只会有复杂的信息关系，而区块链的价值正是证明了这种复杂信息关系的真实性。 （二）重平台，轻连接 &emsp;&emsp;自联盟链诞生后，企业级的区块链应用基本上都是联盟链形态，而联盟链形态无一不代表“厚重”的平台化应用，节点的部署通常选择云化部署，节点实际上分布在同一片“云”上。这种方式的区块链应用不仅造成信息的集中，实际上也代表了治理的集中，除了少数有投票、记账权的节点外，其他节点仅相当于客户端，是被少数节点代理参加网络，其实已经不再具备“自由”权力，这也是联盟链通常被人批评之处，这样的平台与传统分布式系统很难说有本质差别。 &emsp;&emsp;银行的应用，无论是购买平台还是自建平台，都是采用联盟链形态，而且基本不具备向公链扩展的能力，所以一直缺少“杀手级”应用。Libra 提出的技术白皮书则均衡了这个问题，采用联盟链的方式建立初期网络，但是采用能够以低成本建立节点的方式，支持向公链形态扩展和大规模用户部署。所以，Libra 才能够“一石激起千层浪”。 &emsp;&emsp;Libra 引起的广泛关注再次说明了“连接”的重要性，只有逐渐脱离“平台”设计，让区块链易部署，才能让其成为更加广泛的金融基础设施，也能尽快推动标准的发展和互操作、跨链等关键技术的发展。 （三）价值网络的探索不够 &emsp;&emsp;目前国内银行普遍缺少在这方面的探索，随着央行将加快法定数字货币研究工作列为 2019 年下半年重点工作之一，CBDC 呼之欲出，国内银行在价值网络应用方面需要做好充分的准备。货币形态的变化对经济生活影响极大，而数字货币可编程的特点对于当前本就在技术、客户线上场景构建和驾驭方面具有优势的互联网科技公司而言，不次于获得了一个新的“加速器”。 &emsp;&emsp;综上，当区块链技术逐渐“正向”发展的时候，所有银行都应当认真思考这一技术形态代表的可能性，尽管最后让银行“惊讶”的未必就是区块链，但是技术创新的颠覆性，已经被区块链这种在技术领域远称不上复杂的实现方式再次演示出来。 作者简介：付晓岩，《企业级业务架构设计：方法论与实践》作者，原国有大行资深业务架构师，负责业务架构设计、项目管理，热衷新技术探索与实践，具有丰富的银行业务经验和企业级项目业务架构设计经验，曾主导客户关系、金融市场、同业、资管、养老金等多个领域核心系统的业务架构设计，现就职于建信金融科技有限责任公司。公众号：晓谈岩说。","categories":[],"tags":[],"author":"钰湚"},{"title":"金融科技盛宴（一）：开放银行到底都开放了什么？","slug":"FintechBanquet1","date":"2019-12-31T00:39:43.000Z","updated":"2019-12-31T03:07:29.385Z","comments":true,"path":"2019/12/31/FintechBanquet1/","link":"","permalink":"http://yoursite.com/2019/12/31/FintechBanquet1/","excerpt":"","text":"&emsp;&emsp;国外第一个颁布法令勒令银行开放的是英国, 英国推进“开放银行”起源于 2014 年开始的一项为期两年的银行业调查。调查显示，英国四大行包办了 80% 的个人帐户，账户持有人更换账户行的概率只有 3%，已经形成了寡头垄断导致竞争不足，阻碍了金融业创新。因此，产生了最初由监管驱动的“开放银行”概念。&emsp;&emsp;由于发展时间不长且理解各异，“开放银行”如其概念一般让人觉得含混不清。Gartner 公司将其定义为一种平台化商业模式，通过与商业生态系统共享数据、算法、交易、流程和其他业务功能，为商业生态系统的客户、员工、第三方开发者、金融科技公司、供应商和其他合作伙伴提供服务，使银行创造出新的价值，构建新的核心能力。针对这个定义，如果读者换个角度去看，这实际上就是目前头部互联网企业的经营模式，因此，还是无法解释开放银行到底意义何在。下面笔者梳理下国外和国内“开放银行”的实践案例，以供大家分析参考。 一、国外银行“开放银行”发展情况&emsp;&emsp;欧洲与美国的“开放银行”有所不同，下面本书分别介绍这两部分： （一）欧洲的“开放银行”&emsp;&emsp;2014 年底，英国政府委托开放数据研究所 (ODI) 和监管政策咨询机构 Fingleton Associates 联合发布《数据分享和银行的开放数据》报告。此后，英国财政部与 ODI 合作组织建立开放银行工作组 (OBWG)，制定银行业开放 API 的详细标准与框架。2016 年，《开放银行标准框架》(OBS) 公布，英国竞争与市场管理局 (CMA) 要求最大的 9 家银行（被统称 CMA9）限定时间落实 OBS。&emsp;&emsp;欧盟 2016 年通过 PSD2(Payment Service Directive 2 支付服务规划 2) 法令，规定在 2018 年 1 月 13 日起欧洲银行必须把支付服务和相关客户数据开放给第三方服务商。&emsp;&emsp;所以，对于英国银行而言，在 PSD2 和 CMA 双重压力下，开放银行是监管合规要求与创新活动的“混合体”。&emsp;&emsp;然而，英国 CMA9 并没能在 2018 年 1 月 13 日之前全部推出其开放银行计划，只有 4 家金融机构于做好了准备：Allied IrishBank，Danske Bank，劳埃德银行集团和全国建筑协会。进度未满足要求的银行包括巴克莱银行、爱尔兰银行、苏格兰皇家银行和汇丰银行，他们获得六周的宽限期；而桑坦德所有的 Cater Allen 则获得一年的宽限时间。&emsp;&emsp;2018 年 1 月到 8 月，政府陆续发布了三版开放银行标准。2018 年 6 月，Token 成为第一个使用开放银行 API 完成端到端交易的持牌支付服务供应商。到 11 月，CMA9 称已有 17 家第三方提供商在使用开放银行业务，开放银行技术使用了 1750 万次，高于 10 月份的 1390 万次和 9 月份的 650 万次。&emsp;&emsp;尽管 2018 年被称为开放银行元年，各大银行陆续履行承诺，但是到了年底，也有质疑之声出现。Regency Analysis 的创始人兼董事总经理斯图尔特·杰克逊表示：“尽管开放银行代表针对消费者迈出了巨大的一步，但要使整个事情真正发挥作用仍然需要克服障碍，其中最大的一个（障碍）就是存在潜在的怀疑，即零售银行遵守字面上的文件而不是法律精神。毕竟，他们为什么要帮助他们的竞争对手？这是生意，不是游戏”。&emsp;&emsp;2019 年 1 月 13 日，英国开放银行计划启动满一周年，该计划在 12 个月的时间里导致老牌银行失去了对支付服务的严格控制，金融科技公司获得更广泛的潜在客户群。2019 年 1 季度，除 CMA9 外，另有 10 多家银行自愿加入开放行列。&emsp;&emsp;2019 年 9 月，所有欧盟公司都必须满足 PSD2 要求，这意味着支付领域的全体“开放”。&emsp;&emsp;除了英国的 CMA9 外，西班牙的 BBVA 银行也是“开放银行”理念的积极践行者。BBVA 于 2016 年正式启动开放 API 项目，聘请了美国数字银行 Simple 的联合创始人 Shamir Karkal 作为项目负责人。在随后的平台试行阶段，BBVA 邀请了超过 1,500 家企业和开发者参与测试，以期更好地了解平台与合作伙伴的关系，提高开发环境的安全性。&emsp;&emsp;自 2017 年 5 月起，BBVA API Market 对西班牙客户正式开放（https://www.bbvaapimarket.com/home），这是 BBVA 开放银行战略的首个成果。外部开发人员可以在 BBVA 的 API 市场上发现、访问、测试 API，以便在自己的应用程序中使用。截止到 2019 年初，BBVA 在西班牙、美国、墨西哥三个国家共计开放了 10 个 API：7 个基于银行零售端用户信息，1 个基于企业信息，还有 2 个是多渠道数据的整合。&emsp;&emsp;德国的 SolarisBank 也是一家非常契合开放银行理念的银行，它的前身是一家纯技术公司，于 2016 年 3 月正式从德国联邦金融监管局处取得了全银行牌照。但 SolarisBank 本身并不经营传统银行的业务，而是为第三方企业提供开放 API 服务。据统计，SolarisBank 已经在底层推出超过 180 个 API 端口，大致可分为三大类：一是数字银行和银行卡类 API，用于对接传统银行账户；二是符合 PSD2 要求的支付类 API，主要用于合作公司向客户提供礼品卡及相关服务；三是贷款类 API，帮助在线平台实现全自动化风险评估和数字化签名认证，将个人消费贷款或者中小微企业贷款整合到自己的商业流程中。 （二）美国的“开放银行”&emsp;&emsp;与欧洲相比，美国具有更加开放包容的金融环境。首先，作为美国最全面的金融监管改革法案，《多德 - 弗兰克法案》在其 1033 条明确规定用户或者用户授权的机构，有权获取该用户在金融机构的金融交易数据；其次，美国的金融市场竞争激烈，金融机构开放程度高，金融机构都把发展金融科技作为重点，有实力的银行主动开发数据接口，转型成为平台型金融服务公司。&emsp;&emsp;花旗是全球领先的跨国银行，目前在全球 160 多个国家及司法辖区开展业务，拥有约 2 亿的客户账户，为个人、公司、政府和机构提供消费者银行与信贷、投资银行、证券经纪等种类繁多的金融产品及服务。&emsp;&emsp;2016 年 11 月，花旗银行在全球范围内正式推出 API Developer Hub（API 开发者中心），将账户管理、账户授权、信用卡、转账、花旗点数等 8 大类 API 开放给外部开发者调用。随着时间的推移，花旗也在逐渐添加新的 API 类别。迄今为止，花旗已在全球各个国家开放了 9 种类型的 API。&emsp;&emsp;富国银行在 2016 年也创建了 API 开放平台“Wells Fargo Gateway”，在美国开放了数据信息服务和支付 2 大类 14 小类 API 服务，基于邀请对合作伙伴进行开放。2017 年初，北美著名的理财软件 Mint 与富国银行签订了数据共享协议。 二、国内银行“开放银行”发展情况&emsp;&emsp;2018 年，国内“开放银行”的发展“突然”进入了一个快速增长阶段，各行纷纷以平台化思路推出开放银行服务。 （一）建行&emsp;&emsp;建行 2018 年 8 月份推出了“开放银行管理平台”，将建行已有的金融服务，如账户开立、支付结算、投资理财等，以标准统一的接口（API）封装到软件开发工具包（SDK）中，以产品的概念对外发布，为第三方提供标准化的接入流程，将建行优势的产品功能嵌入第三方场景的方式，与独角兽企业平台合作，共享市场。&emsp;&emsp;建行开放银行的定位是通过提供标准化的开放模式，赋能行业合作伙伴，将金融服务延伸至外部合作平台，以客户为中心，以场景为载体，打造数字时代银行服务新连接，构建开放、合作、共享的网络金融服务。&emsp;&emsp;产品方面，通过开放平台已经发布了建行“惠懂你”、直销银行、生活服务、贷款服务、信用卡、账户管理等产品。通过与战略合作伙伴如中国联通、万科、碧桂园、海尔、小米、菜鸟驿站等建立合作关系，产品覆盖政务工商、住房租赁、三农务工等方面。&emsp;&emsp;建行开放平台的接入流程，从注册到成功上线，平均为 7 个工作日。2019 年 3 月，国务院 APP 接入建行个人客户合约信息查询，从服务开放到成功上线仅用 2 个工作日。 （二）微众银行&emsp;&emsp;2019 年 3 月 23 日，微众银行副行长兼 CIO 马智涛先生提出了微众“3O”开放银行理念：开放平台（Open Platform），通过 API、SDK 和 H5 嵌入模式，把银行能力嵌入到合作方中；开放创新（Open Innovation），把自身积累的科技能力通过开源、软件授权的方式帮助行业以及合作伙伴；开放协作（Open Collaboration），连同合作伙伴跨业界、跨产业、跨机构的开展联合创新，形成多方参与的分布式商业生态。&emsp;&emsp;技术层面，支持微众构建开放银行平台的主要技术体系是其经过 5 年多的时间累积形成的“微核心”——微众分布式银行核心系统，包括分布式架构管理框架“WeCube”、一站式金融级开源开放大数据平台套件“WeDataSphere”和金融科技沙盒“FinTech Sandbox”。 （三）平安&emsp;&emsp;平安银行 2017 年曾推出开放平台，并有平安开放平台网站（ http://api.pingan.com.cn ）。之后，平安集团不断增加研发投入，2019 年 5 月 29 日，平安集团旗下金融壹账通在深圳正式发布 Gamma O 开放平台。Gamma O 平台的特点如下：&emsp;&emsp;1. “App Store”一站式接入。Gamma O 开放多家科技服务商（包括金融壹账通）的人工智能、大数据等前沿科技的 API 接口，集合产品、系统及定制需求，链接优秀开发者的技术开发能力，银行可灵活调用接口，实现产品的快速落地。&emsp;&emsp;2. 建立严格准入标准。结合自身应用经验，金融壹账通探索出了一套严格的准入机制及筛选标准。Gamma O 基于此，结合平台自身安全规范及授权协议，对接入的企业开发者进行层层筛选。&emsp;&emsp;3. 提供平台沙盒测试环境。Gamma O 平台提供了测试沙盒，为创新产品提供测试环境，提高创新产品的安全性、稳定性，推动广大金融科技创新。&emsp;&emsp;平安集团对 Gamma O 的定位是“4 个开放”，即开放技术、开放客户、开放场景、开放资本，希望通过打造 “金融机构的科技 APP Store”，探索构建一个共同生态圈。Gamma O 未来三年的目标是至少形成 500 个 API 开放能力、吸引 500 家入驻的金融机构，在平台上培养 API MALL、产品 MALL 搜索习惯，引入 5000 家入驻的服务商，完成 500 个成交项目。&emsp;&emsp;此外，浦发银行 2018 年 7 月也宣布推出“API BANK”无界开放银行，其愿景便是实现“服务触点的无界延伸”，就像“连接器”，把金融与各行业连接起来，构成一个开放共享、共建共赢的生态圈，例如， API Bank 嵌入到社区 App 中，业主可以直接使用社区 App 支付物业费、在社区商户消费获得优惠、预约保洁服务等，银行在背后提供了支付、权益优惠、积分等各项金融服务；2018 年 9 月 17 日，招商银行开放平台上线，开放用户体系及支付体系，所有企业都可在线成为招行企业 APP 用户，而不必开立招行账户，此外，还开放了身份认证、安全、支付、终端等 API 接口，能够支持多个小程序，与第三方共同开发个性化、本地化的功能，实现金融和生活场景的衔接；2018 年 10 月，湖北首家民营银行众邦银行推出“众邦银行开放平台”，这也是华中地区首家上线的开放银行平台。 三、关于开放银行的思考&emsp;&emsp;从以上的介绍中可以看出，“开放银行”在欧美是由于监管直接要求或间接倡导而发展起来的，其本意是维护市场化竞争，为消费者提供更多选择，并非以技术革新为目标。由于监管的积极参与，相关规定也比较明确。商业银行在落地监管要求的过程中，逐渐挖掘其市场价值，形成银行自身变革，以及银行与科技公司间更为紧密的合作关系。形式上，有的银行产生了平台化倾向，如花旗、BBVA，而多数银行并非以此为导向构建运营模式。&emsp;&emsp;国内，尽管有资料称 2013 年中行已经率先建立开放银行平台，但“开放银行”迅速崛起则是在 2018 年。虽然技术手段上与国外类似，也以 API、SDK、H5 等接入方式为主，但比较明显地可以看出多是其原有的平台化、生态圈经营理念的“开放银行化”。&emsp;&emsp;也有分析指出，国外的“开放银行”比较注重数据层面的开放，国内虽然也有银行提倡，但在银行间、银行与第三方间，核心数据的开放程度依然有限。&emsp;&emsp;概念“火热”的背后，还是应该认真分析其内涵。“开放银行”到底开放的是什么？国外显然开放的是“壁垒”，以促进竞争；国内目前开放的核心是技术，通过技术开放构建生态，但是，如果深究这个目的，那么，国内的“开放银行”从银行业的视角来看，与其说“开放”，不如说“适应”，是面对场景争夺、“银行消失论”等环境变化的一种适应。&emsp;&emsp;布莱特·金 (Brett King) 先生在《BANK 4.0》一书中描述，“金融服务无处不在，就是不在银行”，这显然就是对“无感”金融服务的一种描述，而这种“无感”金融服务靠的也是服务与场景的深度、无缝融合，也即，金融服务中的线上部分本来就要在技术发展的背景下进化到类似计算机系统中的服务调用形态，而无需用一个专有名词来概括。&emsp;&emsp;“开放银行”目前在概念上还在不断创新变化，也是金融机构未来发展的重要方向之一，未来金融服务可以按需求“拼凑”业务，随时出现，达到其作为服务行业的最高境界。&emsp;&emsp;对于监管而言，“开放银行”会更加模糊金融机构和科技公司的界限，使监管方向朝向更加注重行为而非机构去发展。 参考资料： 《“开放银行”：请从金融科技总规划上着力》，2019-04-28，李鑫，上海证券报。 《英国开放银行一周年：对于开放银行九家参与银行是这么看的》，2019-03-27，浦东改发院金融研究室主任刘斌，点滴科技资讯。 《开放银行的全球实践与展望：打破藩篱 合作共赢》，2019-05，麦肯锡。 《开放银行欧美国家的探索实践》，2019-04-01，兴业数金。 《建设银行分享：开放银行管理平台建设实践》，2019-08-19，神州信息。","categories":[],"tags":[],"author":"钰湚"},{"title":"Hello World","slug":"hello-world","date":"2019-12-30T13:31:42.051Z","updated":"2019-12-30T13:31:42.051Z","comments":true,"path":"2019/12/30/hello-world/","link":"","permalink":"http://yoursite.com/2019/12/30/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}